RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M# Processor and Core Peripherals */
#define __CM4_REV                 0x0201    /*!< Core Revision r2p1                               */
#define __NVIC_PRIO_BITS          4         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used     */
#define __MPU_PRESENT             1         /*!< MPU present or not                               */
#define __FPU_PRESENT             1         /*!< FPU present or not                               */

/*@}*/ /* end of group NUC472_442_CMSIS */


#include "core_cm4.h"                       /* Cortex-M4 processor and core peripherals           */
#include "system_NUC472_442.h"            /* NUC472/NUC442 System include file                         */
#include <stdint.h>

/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/
/** @addtogroup NUC472_442_Peripherals NUC472/NUC442 Control Register
  NUC472/NUC442 Device Specific Peripheral registers structures
  @{
*/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


/*---------------------- Analog Comparator Controller -------------------------*/
/**
    @addtogroup ACMP Analog Comparator Controller(ACMP)
    Memory Mapped Structure for ACMP Controller
@{ */

typedef struct {


    /**
     * CTL0, CTL1, CTL2
     * ===================================================================================================
     * Offset: 0x00~0x08 Analog Comparator 0/1/2 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ACMPEN    |Comparator x Enable Control
     * |        |          |0 = Comparator x Disabled.
     * |        |          |1 = Comparator x Enabled.
     * |        |          |Note: The comparator output needs to wait 2 us stable time after ACMPEN is set.
     * |[1]     |ACMPIE    |Comparator x Interrupt Enable Control
     * |        |          |0 = Comparator x interrupt Disabled.
     * |        |          |1 = Comparator x interrupt Enabled.
     * |[2]     |HYSEN     |Comparator x Hysteresis Enable Control
     * |        |          |0 = Comparator x hysteresis Disabled (Default).
     * |        |          |1 = Comparator x hysteresis Enabled (typical range is 20 mV).
     * |[3]     |ACMPOINV  |Comparator x Output Inverse
     * |        |          |0 = Comparator x output inverse Disabled.
     * |        |          |1 = Comparator x output inverse Enabled.
     * |[4]     |NEGSEL    |Comparator x Negative Input Selection
     * |        |          |0 = The source of comparator x negative input is from ACMP0_N pin.
     * |        |          |1 = The internal comparator reference voltage (Band-gap voltage or CRV) is selected as the source of comparator x negative input.
     * |[5:7]   |POSSEL    |Comparator x Positive Input Selection
     * |        |          |000= Input from ACMPx_P0.
     * |        |          |001= Input from ACMPx_P1.
     * |        |          |010= Input from ACMPx_P2.
     * |        |          |011= Input from ACMPx_P3.
     * |        |          |100= Input from OPA0x. (Reserved for ACMP2)
     * |        |          |The other options are reserved.
    */
    __IO uint32_t CTL[3];

    /**
     * STATUS
     * ===================================================================================================
     * Offset: 0x0C  Analog Comparator Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ACMPIF0   |Comparator 0 Flag
     * |        |          |This bit is set by hardware whenever the comparator 0 output changes state.
     * |        |          |This will cause an interrupt if ACMP_CTL0[1] is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[1]     |ACMPIF1   |Comparator 1 Flag
     * |        |          |This bit is set by hardware whenever the comparator 1 output changes state.
     * |        |          |This will cause an interrupt if ACMP_CTL1[1] is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[2]     |ACMPIF2   |Comparator 2 Flag
     * |        |          |This bit is set by hardware whenever the comparator 2 output changes state.
     * |        |          |This will cause an interrupt if ACMP_CTL2[1] is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[3]     |ACMPO0    |Comparator 0 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 0 is disabled (ACMP_CTL0[0] = 0).
     * |[4]     |ACMPO1    |Comparator 1 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 1 is disabled (ACMP_CTL1[0] = 0).
     * |[5]     |ACMPO2    |Comparator 2 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 2 is disabled (ACMP_CTL2[0] = 0).
    */
    __IO uint32_t STATUS;

    /**
     * VREF
     * ===================================================================================================
     * Offset: 0x10  Analog Comparator Reference Voltage Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CRVCTL    |Comparator Reference Voltage Setting
     * |        |          |CRV = CRV source voltage * (1/6+VREF[3:0]/24).
     * |[6]     |CRVSSEL   |CRV Source Voltage Selection
     * |        |          |0 = VDDA is selected as CRV source voltage.
     * |        |          |1 = Internal reference voltage is selected as CRV source voltage.
     * |[7]     |IREFSEL   |Internal Reference Selection
     * |        |          |0 = Band-gap voltage is selected as internal reference.
     * |        |          |1 = CRV is selected as internal reference.
    */
    __IO uint32_t VREF;

} ACMP_T;

/**
    @addtogroup ACMP_CONST ACMP Bit Field Definition
    Constant Definitions for ACMP Controller
@{ */

#define ACMP_CTL_ACMPEN_Pos              (0)                                               /*!< ACMP_T::CTL: ACMPEN Position              */
#define ACMP_CTL_ACMPEN_Msk              (0x1ul << ACMP_CTL_ACMPEN_Pos)                    /*!< ACMP_T::CTL: ACMPEN Mask                  */

