RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define ADC_DAT0_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT0_OV_Msk                  (0x1ul << ADC_DAT0_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT0_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT0_VALID_Msk               (0x1ul << ADC_DAT0_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT1_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT1_RESULT_Msk              (0xfffful << ADC_DAT1_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT1_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT1_OV_Msk                  (0x1ul << ADC_DAT1_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT1_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT1_VALID_Msk               (0x1ul << ADC_DAT1_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT2_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT2_RESULT_Msk              (0xfffful << ADC_DAT2_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT2_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT2_OV_Msk                  (0x1ul << ADC_DAT2_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT2_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT2_VALID_Msk               (0x1ul << ADC_DAT2_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT3_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT3_RESULT_Msk              (0xfffful << ADC_DAT3_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT3_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT3_OV_Msk                  (0x1ul << ADC_DAT3_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT3_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT3_VALID_Msk               (0x1ul << ADC_DAT3_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT4_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT4_RESULT_Msk              (0xfffful << ADC_DAT4_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT4_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT4_OV_Msk                  (0x1ul << ADC_DAT4_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT4_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT4_VALID_Msk               (0x1ul << ADC_DAT4_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT5_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT5_RESULT_Msk              (0xfffful << ADC_DAT5_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT5_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT5_OV_Msk                  (0x1ul << ADC_DAT5_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT5_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT5_VALID_Msk               (0x1ul << ADC_DAT5_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT6_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT6_RESULT_Msk              (0xfffful << ADC_DAT6_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT6_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT6_OV_Msk                  (0x1ul << ADC_DAT6_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT6_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT6_VALID_Msk               (0x1ul << ADC_DAT6_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT7_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT7_RESULT_Msk              (0xfffful << ADC_DAT7_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT7_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT7_OV_Msk                  (0x1ul << ADC_DAT7_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT7_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT7_VALID_Msk               (0x1ul << ADC_DAT7_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT8_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT8_RESULT_Msk              (0xfffful << ADC_DAT8_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT8_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT8_OV_Msk                  (0x1ul << ADC_DAT8_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT8_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT8_VALID_Msk               (0x1ul << ADC_DAT8_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

#define ADC_DAT9_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT9_RESULT_Msk              (0xfffful << ADC_DAT9_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

#define ADC_DAT9_OV_Pos                  (16)                                              /*!< ADC_T::DAT: OV Position                  */
#define ADC_DAT9_OV_Msk                  (0x1ul << ADC_DAT9_OV_Pos)                        /*!< ADC_T::DAT: OV Mask                      */

#define ADC_DAT9_VALID_Pos               (17)                                              /*!< ADC_T::DAT: VALID Position               */
#define ADC_DAT9_VALID_Msk               (0x1ul << ADC_DAT9_VALID_Pos)                     /*!< ADC_T::DAT: VALID Mask                   */

