RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define ADC_CTL_DMOF_Pos                 (31)                                              /*!< ADC_T::CTL: DMOF Position                 */
#define ADC_CTL_DMOF_Msk                 (0x1ul << ADC_CTL_DMOF_Pos)                       /*!< ADC_T::CTL: DMOF Mask                     */

#define ADC_CHEN_CHEN_Pos                (0)                                               /*!< ADC_T::CHEN: CHEN Position                */
#define ADC_CHEN_CHEN_Msk                (0xffful << ADC_CHEN_CHEN_Pos)                    /*!< ADC_T::CHEN: CHEN Mask                    */

#define ADC_CHEN_ADTSEN_Pos              (16)                                              /*!< ADC_T::CHEN: ADTSEN Position              */
#define ADC_CHEN_ADTSEN_Msk              (0x1ul << ADC_CHEN_ADTSEN_Pos)                    /*!< ADC_T::CHEN: ADTSEN Mask                  */

#define ADC_CHEN_ADBGEN_Pos              (17)                                              /*!< ADC_T::CHEN: ADBGEN Position              */
#define ADC_CHEN_ADBGEN_Msk              (0x1ul << ADC_CHEN_ADBGEN_Pos)                    /*!< ADC_T::CHEN: ADBGEN Mask                  */

#define ADC_CMP0_ADCMPEN_Pos             (0)                                               /*!< ADC_T::CMP: ADCMPEN Position             */
#define ADC_CMP0_ADCMPEN_Msk             (0x1ul << ADC_CMP0_ADCMPEN_Pos)                   /*!< ADC_T::CMP: ADCMPEN Mask                 */

#define ADC_CMP0_ADCMPIE_Pos             (1)                                               /*!< ADC_T::CMP: ADCMPIE Position             */
#define ADC_CMP0_ADCMPIE_Msk             (0x1ul << ADC_CMP0_ADCMPIE_Pos)                   /*!< ADC_T::CMP: ADCMPIE Mask                 */

#define ADC_CMP0_CMPCOND_Pos             (2)                                               /*!< ADC_T::CMP: CMPCOND Position             */
#define ADC_CMP0_CMPCOND_Msk             (0x1ul << ADC_CMP0_CMPCOND_Pos)                   /*!< ADC_T::CMP: CMPCOND Mask                 */

#define ADC_CMP0_CMPCH_Pos               (3)                                               /*!< ADC_T::CMP: CMPCH Position               */
#define ADC_CMP0_CMPCH_Msk               (0xful << ADC_CMP0_CMPCH_Pos)                     /*!< ADC_T::CMP: CMPCH Mask                   */

#define ADC_CMP0_CMPMCNT_Pos             (8)                                               /*!< ADC_T::CMP: CMPMCNT Position             */
#define ADC_CMP0_CMPMCNT_Msk             (0xful << ADC_CMP0_CMPMCNT_Pos)                   /*!< ADC_T::CMP: CMPMCNT Mask                 */

#define ADC_CMP0_CMPDAT_Pos              (16)                                              /*!< ADC_T::CMP: CMPDAT Position              */
#define ADC_CMP0_CMPDAT_Msk              (0xffful << ADC_CMP0_CMPDAT_Pos)                  /*!< ADC_T::CMP: CMPDAT Mask                  */

#define ADC_CMP1_ADCMPEN_Pos             (0)                                               /*!< ADC_T::CMP: ADCMPEN Position             */
#define ADC_CMP1_ADCMPEN_Msk             (0x1ul << ADC_CMP1_ADCMPEN_Pos)                   /*!< ADC_T::CMP: ADCMPEN Mask                 */

#define ADC_CMP1_ADCMPIE_Pos             (1)                                               /*!< ADC_T::CMP: ADCMPIE Position             */
#define ADC_CMP1_ADCMPIE_Msk             (0x1ul << ADC_CMP1_ADCMPIE_Pos)                   /*!< ADC_T::CMP: ADCMPIE Mask                 */

#define ADC_CMP1_CMPCOND_Pos             (2)                                               /*!< ADC_T::CMP: CMPCOND Position             */
#define ADC_CMP1_CMPCOND_Msk             (0x1ul << ADC_CMP1_CMPCOND_Pos)                   /*!< ADC_T::CMP: CMPCOND Mask                 */

#define ADC_CMP1_CMPCH_Pos               (3)                                               /*!< ADC_T::CMP: CMPCH Position               */
#define ADC_CMP1_CMPCH_Msk               (0xful << ADC_CMP1_CMPCH_Pos)                     /*!< ADC_T::CMP: CMPCH Mask                   */

#define ADC_CMP1_CMPMCNT_Pos             (8)                                               /*!< ADC_T::CMP: CMPMCNT Position             */
#define ADC_CMP1_CMPMCNT_Msk             (0xful << ADC_CMP1_CMPMCNT_Pos)                   /*!< ADC_T::CMP: CMPMCNT Mask                 */

#define ADC_CMP1_CMPDAT_Pos              (16)                                              /*!< ADC_T::CMP: CMPDAT Position              */
#define ADC_CMP1_CMPDAT_Msk              (0xffful << ADC_CMP1_CMPDAT_Pos)                  /*!< ADC_T::CMP: CMPDAT Mask                  */

#define ADC_STATUS0_ADIF_Pos             (0)                                               /*!< ADC_T::STATUS0: ADIF Position             */
#define ADC_STATUS0_ADIF_Msk             (0x1ul << ADC_STATUS0_ADIF_Pos)                   /*!< ADC_T::STATUS0: ADIF Mask                 */

#define ADC_STATUS0_ADCMPF0_Pos          (1)                                               /*!< ADC_T::STATUS0: ADCMPF0 Position          */
#define ADC_STATUS0_ADCMPF0_Msk          (0x1ul << ADC_STATUS0_ADCMPF0_Pos)                /*!< ADC_T::STATUS0: ADCMPF0 Mask              */

#define ADC_STATUS0_ADCMPF1_Pos          (2)                                               /*!< ADC_T::STATUS0: ADCMPF1 Position          */
#define ADC_STATUS0_ADCMPF1_Msk          (0x1ul << ADC_STATUS0_ADCMPF1_Pos)                /*!< ADC_T::STATUS0: ADCMPF1 Mask              */

#define ADC_STATUS0_BUSY_Pos             (3)                                               /*!< ADC_T::STATUS0: BUSY Position             */
#define ADC_STATUS0_BUSY_Msk             (0x1ul << ADC_STATUS0_BUSY_Pos)                   /*!< ADC_T::STATUS0: BUSY Mask                 */

#define ADC_STATUS0_CHANNEL_Pos          (4)                                               /*!< ADC_T::STATUS0: CHANNEL Position          */
#define ADC_STATUS0_CHANNEL_Msk          (0xful << ADC_STATUS0_CHANNEL_Pos)                /*!< ADC_T::STATUS0: CHANNEL Mask              */

#define ADC_STATUS1_VALID_Pos            (0)                                               /*!< ADC_T::STATUS1: VALID Position            */
#define ADC_STATUS1_VALID_Msk            (0x3ffful << ADC_STATUS1_VALID_Pos)               /*!< ADC_T::STATUS1: VALID Mask                */

#define ADC_STATUS1_OV_Pos               (16)                                              /*!< ADC_T::STATUS1: OV Position               */
#define ADC_STATUS1_OV_Msk               (0x3ffful << ADC_STATUS1_OV_Pos)                  /*!< ADC_T::STATUS1: OV Mask                   */

#define ADC_CURDAT_CURDAT_Pos            (0)                                               /*!< ADC_T::CURDAT: CURDAT Position            */
#define ADC_CURDAT_CURDAT_Msk            (0x3fffful << ADC_CURDAT_CURDAT_Pos)              /*!< ADC_T::CURDAT: CURDAT Mask                */

