RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
    /**
     * PKTSM
     * ===================================================================================================
     * Offset: 0x48  Packet Scaling Vertical/Horizontal Factor Register (MSB)
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |PKTSHMH   |Packet Scaling Horizontal Factor M (Higher 8-Bit)
     * |        |          |Specify the lower 8-bit of denominator part (M) of the horizontal scaling factor.
     * |        |          |Please refer to the register CAP_PKTSL?for the detailed operation.
     * |[8:15]  |PKTSHNH   |Packet Scaling Horizontal Factor N (Higher 8-Bit)
     * |        |          |Specify the lower 8-bit of numerator part (N) of the horizontal scaling factor.
     * |        |          |Please refer to the register CAP_PKTSL for the detailed operation.
     * |[16:23] |PKTSVMH   |Packet Scaling Vertical Factor M (Higher 8-Bit)
     * |        |          |Specify the lower 8-bit of denominator part (M) of the vertical scaling factor.
     * |        |          |Please refer to the register CAP_PKTSL to check the cooperation between these two registers.
     * |[24:31] |PKTSVNH   |Packet Scaling Vertical Factor N (Higher 8-Bit)
     * |        |          |Specify the higher 8-bit of numerator part (N) of the vertical scaling factor.
     * |        |          |Please refer to the register CAP_PKTSL?to check the cooperation between these two registers.
    */
    __IO uint32_t PKTSM;

    /**
     * PLNSM
     * ===================================================================================================
     * Offset: 0x4C  Planar Scaling Vertical/Horizontal Factor Register (MSB)
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |PLNSHMH   |Planar Scaling Horizontal Factor M (Higher 8-Bit)
     * |        |          |Specifies the higher 8-bit of denominator part (M) of the horizontal scaling factor
     * |        |          |For detailed programming, please refer to the register “CAP_PLNSL?
     * |[8:15]  |PLNSHNH   |Planar Scaling Horizontal Factor N (Higher 8-Bit)
     * |        |          |Specifies the higher 8-bit of numerator part (N) of the horizontal scaling factor.
     * |        |          |For detailed programming, please refer to the register “CAP_PLNSL?
     * |[16:23] |PLNSVMH   |Planar Scaling Vertical Factor M (Higher 8-Bit)
     * |        |          |Specifies the lower 8-bit of denominator part (M) of the vertical scaling factor.
     * |        |          |For detailed programming, please refer to the register “CAP_PLNSL?
     * |[24:31] |PLNSVNH   |Planar Scaling Vertical Factor N (Higher 8-Bit)
     * |        |          |Specifies the higher 8-bit of numerator part (N) of the vertical scaling factor.
     * |        |          |For detailed programming, please refer to the register “CAP_PLNSL?
    */
    __IO uint32_t PLNSM;

    /**
     * CURADDRP
     * ===================================================================================================
     * Offset: 0x50  Current Packet System Memory Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |CURADDR   |Current Packet Output Memory Address
    */
    __I  uint32_t CURADDRP;

    /**
     * CURADDRY
     * ===================================================================================================
     * Offset: 0x54  Current Planar Y System Memory Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |CURADDR   |Current Planar Y Output Memory Address
    */
    __I  uint32_t CURADDRY;

    /**
     * CURADDRU
     * ===================================================================================================
     * Offset: 0x58  Current Planar U System Memory Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |CURADDR   |Current Planar U Output Memory Address
    */
    __I  uint32_t CURADDRU;

    /**
     * CURVADDR
     * ===================================================================================================
     * Offset: 0x5C  Current Planar V System Memory Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |CURADDR   |Current Planar V Output Memory Address
    */
    __I  uint32_t CURVADDR;

    /**
     * PKTBA0
     * ===================================================================================================
     * Offset: 0x60  System Memory Packet Base Address 0 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |BASEADDR  |System Memory Packet Base Address 0
     * |        |          |Word aligns address; ignore the bits [1:0].
    */
    __IO uint32_t PKTBA0;

    /**
     * PKTBA1
     * ===================================================================================================
     * Offset: 0x64  System Memory Packet Base Address 1 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |BASEADDR  |System Memory Packet Base Address 1
     * |        |          |Word aligns address; ignore the bits [1:0].
    */
    __IO uint32_t PKTBA1;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[6];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * YBA
     * ===================================================================================================
     * Offset: 0x80  System Memory Planar Y Base Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |BASEADDR  |System Memory Planar Y Base Address
     * |        |          |Word aligns address; ignore the bits [1:0].
    */
    __IO uint32_t YBA;

    /**
     * UBA
     * ===================================================================================================
     * Offset: 0x84  System Memory Planar U Base Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |BASEADDR  |System Memory Planar U Base Address
     * |        |          |Word aligns address; ignore the bits [1:0].
    */
    __IO uint32_t UBA;

    /**
     * VBA
     * ===================================================================================================
     * Offset: 0x88  System Memory Planar V Base Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |BASEADDR  |System Memory Planar V Base Address
     * |        |          |Word aligns address; ignore the bits [1:0].
    */
    __IO uint32_t VBA;

