RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define ECAP_CTL0_CMPEN_Pos              (28)                                              /*!< ECAP_T::CTL0: CMPEN Position              */
#define ECAP_CTL0_CMPEN_Msk              (0x1ul << ECAP_CTL0_CMPEN_Pos)                    /*!< ECAP_T::CTL0: CMPEN Mask                  */

#define ECAP_CTL0_CAPEN_Pos              (29)                                              /*!< ECAP_T::CTL0: CAPEN Position              */
#define ECAP_CTL0_CAPEN_Msk              (0x1ul << ECAP_CTL0_CAPEN_Pos)                    /*!< ECAP_T::CTL0: CAPEN Mask                  */

#define ECAP_CTL1_EDGESEL0_Pos           (0)                                               /*!< ECAP_T::CTL1: EDGESEL0 Position           */
#define ECAP_CTL1_EDGESEL0_Msk           (0x3ul << ECAP_CTL1_EDGESEL0_Pos)                 /*!< ECAP_T::CTL1: EDGESEL0 Mask               */

#define ECAP_CTL1_EDGESEL1_Pos           (2)                                               /*!< ECAP_T::CTL1: EDGESEL1 Position           */
#define ECAP_CTL1_EDGESEL1_Msk           (0x3ul << ECAP_CTL1_EDGESEL1_Pos)                 /*!< ECAP_T::CTL1: EDGESEL1 Mask               */

#define ECAP_CTL1_EDGESEL2_Pos           (4)                                               /*!< ECAP_T::CTL1: EDGESEL2 Position           */
#define ECAP_CTL1_EDGESEL2_Msk           (0x3ul << ECAP_CTL1_EDGESEL2_Pos)                 /*!< ECAP_T::CTL1: EDGESEL2 Mask               */

#define ECAP_CTL1_RLDSEL_Pos             (8)                                               /*!< ECAP_T::CTL1: RLDSEL Position             */
#define ECAP_CTL1_RLDSEL_Msk             (0x7ul << ECAP_CTL1_RLDSEL_Pos)                   /*!< ECAP_T::CTL1: RLDSEL Mask                 */

#define ECAP_CTL1_CLKSEL_Pos             (12)                                              /*!< ECAP_T::CTL1: CLKSEL Position             */
#define ECAP_CTL1_CLKSEL_Msk             (0x7ul << ECAP_CTL1_CLKSEL_Pos)                   /*!< ECAP_T::CTL1: CLKSEL Mask                 */

#define ECAP_CTL1_SRCSEL_Pos             (16)                                              /*!< ECAP_T::CTL1: SRCSEL Position             */
#define ECAP_CTL1_SRCSEL_Msk             (0x3ul << ECAP_CTL1_SRCSEL_Pos)                   /*!< ECAP_T::CTL1: SRCSEL Mask                 */

#define ECAP_STATUS_CAPF0_Pos            (0)                                               /*!< ECAP_T::STATUS: CAPF0 Position            */
#define ECAP_STATUS_CAPF0_Msk            (0x1ul << ECAP_STATUS_CAPF0_Pos)                  /*!< ECAP_T::STATUS: CAPF0 Mask                */

#define ECAP_STATUS_CAPF1_Pos            (1)                                               /*!< ECAP_T::STATUS: CAPF1 Position            */
#define ECAP_STATUS_CAPF1_Msk            (0x1ul << ECAP_STATUS_CAPF1_Pos)                  /*!< ECAP_T::STATUS: CAPF1 Mask                */

#define ECAP_STATUS_CAPF2_Pos            (2)                                               /*!< ECAP_T::STATUS: CAPF2 Position            */
#define ECAP_STATUS_CAPF2_Msk            (0x1ul << ECAP_STATUS_CAPF2_Pos)                  /*!< ECAP_T::STATUS: CAPF2 Mask                */

#define ECAP_STATUS_CMPF_Pos             (4)                                               /*!< ECAP_T::STATUS: CMPF Position             */
#define ECAP_STATUS_CMPF_Msk             (0x1ul << ECAP_STATUS_CMPF_Pos)                   /*!< ECAP_T::STATUS: CMPF Mask                 */

#define ECAP_STATUS_OVF_Pos              (5)                                               /*!< ECAP_T::STATUS: OVF Position              */
#define ECAP_STATUS_OVF_Msk              (0x1ul << ECAP_STATUS_OVF_Pos)                    /*!< ECAP_T::STATUS: OVF Mask                  */

/**@}*/ /* ECAP_CONST */
/**@}*/ /* end of ECAP register group */


/*---------------------- System Clock Controller -------------------------*/
/**
    @addtogroup CLK System Clock Controller(CLK)
    Memory Mapped Structure for CLK Controller
@{ */

typedef struct {


    /**
     * PWRCTL
     * ===================================================================================================
     * Offset: 0x00  System Power-down Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HXTEN     |4~24 MHz External High-Speed Crystal Enable Control (Write Protect)
     * |        |          |The bit default value is set by flash controller user configuration register config0 [26:24].
     * |        |          |When the default clock source is from 4~24 MHz external high-speed crystal, this bit is set to 1 automatically
     * |        |          |0 = HXT Disabled.
     * |        |          |1 = HXT Enabled.
     * |[1]     |LXTEN     |LXT Enable Control (Write Protect)
     * |        |          |0 = LXT Disabled.
     * |        |          |1 = LXT (Normal operation) Enabled.
     * |[2]     |HIRCEN    |HIRC Enable Control (Write Protect)
     * |        |          |0 = HIRC Disabled.
     * |        |          |1 = HIRC Enabled.
     * |[3]     |LIRCEN    |10 KHz Internal Low-Speed Oscillator Enable Control (Write Protect)
     * |        |          |0 = LIRC Disabled.
     * |        |          |1 = LIRC Enabled (default 1).
     * |[4]     |PDWKDLY   |Wake-Up Delay Counter Enable Control (Write Protect)
     * |        |          |When the chip wakes up from Power-down mode, the clock control will delay certain clock cycles to wait system clock stable.
     * |        |          |The delayed clock cycle is 4096 clock cycles when chip work at HXT, and 256 clock cycles when chip works at HIRC.
     * |        |          |0 = Clock cycles delay Disabled.
     * |        |          |1 = Clock cycles delay Enabled.
     * |[5]     |PDWKIEN   |Power-Down Mode Wake-Up Interrupt Enable Control (Write Protect)
     * |        |          |0 = Power-down Mode Wake-up Interrupt Disabled.
     * |        |          |1 = Power-down Mode Wake-up Interrupt Enabled.
     * |        |          |Note: The interrupt will occur when both PDWKIF and PDWKIEN are high.
     * |[6]     |PDWKIF    |Power-Down Mode Wake-Up Interrupt Status
     * |        |          |Set by "power-down wake-up event", it indicates that resume from Power-down mode"
     * |        |          |The flag is set if the GPIO, USB, UART, WDT, CAN, ACMP, BOD, RTC or SDHOST wake-up occurred
     * |        |          |Note1: Write 1 to clear the bit to 0.
     * |        |          |Note2: This bit works only if PDWKIEN (CLK_PWRCTL[5]) set to 1.
     * |[7]     |PDEN      |System Power-Down Enable Control (Write Protect)
     * |        |          |When this bit is set to 1, Power-down mode is enabled and chip power-down behavior will depend on the PDEN bit.
     * |        |          |(a) If the PDEN is 0, then the chip enters Power-down mode immediately after
     * |        |          |the PWR_DOWN_EN bit set. ( default)
     * |        |          |(b) if the PDEN is 1, then the chip keeps active till the CPU sleep mode is also
     * |        |          |active and then the chip enters Power-down mode
     * |        |          |When chip wakes up from Power-down mode, this bit is auto cleared. Users need to set
     * |        |          |this bit again for next power-down.
     * |        |          |In Power-down mode, HXT and the HIRC will be disabled in this mode, but the LXT and
     * |        |          |LIRC are not controlled by Power-down mode.
     * |        |          |In Power-down mode, the PLL and system clock are disabled, and ignored the clock
     * |        |          |source selection. The clocks of peripheral are not controlled by Power-down mode, if the
     * |        |          |peripheral clock source is from LXT or the LIRC.
     * |        |          |0 = Chip operating normally or chip in idle mode by WFI command.
     * |        |          |1 = Chip enters Power-down mode instant or waits CPU sleep command WFI.
     * |[8]     |PDWTCPU   |This Bit Control The Power-Down Entry Condition (Write Protect)
     * |        |          |0 = Chip enters Power-down mode when the PWR_DOWN_EN bit is set to 1.
     * |        |          |1 = Chip enters Power-down mode when the both PDEN and PWR_DOWN_EN bits are set to 1 and CPU run WFI instruction.
     * |[9]     |DBPDEN    |Chip Entering Power-Down Even ICE Connected
     * |        |          |0 = Chip enters power-down disabled in Debug mode.
     * |        |          |1 = Chip enters power-down enabled in Debug mode.
    */
    __IO uint32_t PWRCTL;

    /**
     * AHBCLK
     * ===================================================================================================
     * Offset: 0x04  AHB Devices Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |PDMACKEN  |PDMA Controller Clock Enable Control
     * |        |          |0 = PDMA engine clock Disabled.
     * |        |          |1 = PDMA engine clock Enabled.
     * |[2]     |ISPCKEN   |Flash ISP Controller Clock Enable Control
     * |        |          |0 = Flash ISP engine clock Disabled.
     * |        |          |1 = Flash ISP engine clock Enabled.
     * |[3]     |EBICKEN   |EBI Controller Clock Enable Control
     * |        |          |0 = EBI engine clock Disabled.
     * |        |          |1 = EBI engine clock Enabled.
     * |[4]     |USBHCKEN  |USB HOST Controller Clock Enable Control
     * |        |          |0 = USB HOST engine clock Disabled.
     * |        |          |1 = USB HOST engine clock Enabled.
     * |[5]     |EMACCKEN  |Ethernet Controller Clock Enable Control (NUC472 Only)
     * |        |          |0 = Ethernet Controller engine clock Disabled.
     * |        |          |1 = Ethernet Controller engine clock Enabled.
     * |[6]     |SDHCKEN   |SDHOST Controller Clock Enable Control
     * |        |          |0 = SDHOST engine clock Disabled.
     * |        |          |1 = SDHOST engine clock Enabled.
     * |[7]     |CRCCKEN   |CRC Generator Controller Clock Enable Control
     * |        |          |0 = CRC engine clock Disabled.
     * |        |          |1 = CRC engine clock Enabled.
     * |[8]     |CAPCKEN   |Image Capture Interface Controller Clock Enable Control
     * |        |          |0 = CAP controller's clock Disabled.
     * |        |          |1 = CAP controller's clock Enabled.
     * |[9]     |SENCKEN   |Sensor Clock Enable Control
     * |        |          |0 = Sensor clock Disabled.
     * |        |          |1 = Sensor clock Enabled.
     * |[10]    |USBDCKEN  |USB 2.0 Device Clock Enable Control
     * |        |          |0 = USB device controller's clock Disabled.
     * |        |          |1 = USB device controller's clock Enabled.
     * |[12]    |CRPTCKEN  |Cryptographic Accelerator Clock Enable Control
     * |        |          |0 = Cryptographic Accelerator clock Disabled.
     * |        |          |1 = Cryptographic Accelerator clock Enabled.
    */
    __IO uint32_t AHBCLK;

    /**
     * APBCLK0
     * ===================================================================================================
     * Offset: 0x08  APB Devices Clock Enable Control Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WDTCKEN   |Watchdog Timer Clock Enable Control (Write Protect)
     * |        |          |This bit is the protected bit, which means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |0 = Watchdog Timer Clock Disabled.
     * |        |          |1 = Watchdog Timer Clock Enabled.
     * |[1]     |RTCCKEN   |Real-Time-Clock APB Interface Clock Enable Control
     * |        |          |This bit is used to control the RTC APB clock only, The RTC engine clock source is from the 32.768 kHz external low-speed crystal.
     * |        |          |0 = RTC Clock Disabled.
     * |        |          |1 = RTC Clock Enabled.
     * |[2]     |TMR0CKEN  |Timer0 Clock Enable Control
     * |        |          |0 = Timer0 Clock Disabled.
     * |        |          |1 = Timer0 Clock Enabled.
     * |[3]     |TMR1CKEN  |Timer1 Clock Enable Control
     * |        |          |0 = Timer1 Clock Disabled.
     * |        |          |1 = Timer1 Clock Enabled.
     * |[4]     |TMR2CKEN  |Timer2 Clock Enable Control
     * |        |          |0 = Timer2 Clock Disabled.
     * |        |          |1 = Timer2 Clock Enabled.
     * |[5]     |TMR3CKEN  |Timer3 Clock Enable Control
     * |        |          |0 = Timer3 Clock Disabled.
     * |        |          |1 = Timer3 Clock Enabled.
     * |[6]     |CLKOCKEN  |Clock Output Enable Control
     * |        |          |0 = Clock Output Disabled.
     * |        |          |1 = Clock Output Enabled.
     * |[7]     |ACMPCKEN  |Analog Comparator Clock Enable Control
     * |        |          |0 = Analog Comparator Clock Disabled.
     * |        |          |1 = Analog Comparator Clock Enabled.
     * |[8]     |I2C0CKEN  |I2C0 Clock Enable Control
     * |        |          |0 = I2C0 Clock Disabled.
     * |        |          |1 = I2C0 Clock Enabled.
     * |[9]     |I2C1CKEN  |I2C1 Clock Enable Control
     * |        |          |0 = I2C1 Clock Disabled.
     * |        |          |1 = I2C1 Clock Enabled.
     * |[10]    |I2C2CKEN  |I2C2 Clock Enable Control
     * |        |          |0 = I2C2 Clock Disabled.
     * |        |          |1 = I2C2 Clock Enabled.
     * |[11]    |I2C3CKEN  |I2C3 Clock Enable Control
     * |        |          |0 = I2C3 Clock Disabled.
     * |        |          |1 = I2C3 Clock Enabled.
     * |[12]    |SPI0CKEN  |SPI0 Clock Enable Control
     * |        |          |0 = SPI0 Clock Disabled.
     * |        |          |1= SPI0 Clock Enabled.
     * |[13]    |SPI1CKEN  |SPI1 Clock Enable Control
     * |        |          |0 = SPI1 Clock Disabled.
     * |        |          |1 = SPI1 Clock Enabled.
     * |[14]    |SPI2CKEN  |SPI2 Clock Enable Control
     * |        |          |0 = SPI2 Clock Disabled.
     * |        |          |1 = SPI2 Clock Enabled.
     * |[15]    |SPI3CKEN  |SPI3 Clock Enable Control
     * |        |          |0 = SPI3 Clock Disabled.
     * |        |          |1 = SPI3 Clock Enabled.
     * |[16]    |UART0CKEN |UART0 Clock Enable Control
     * |        |          |0 = UART0 clock Disabled.
     * |        |          |1 = UART0 clock Enabled.
     * |[17]    |UART1CKEN |UART1 Clock Enable Control
     * |        |          |0 = UART1 clock Disabled.
     * |        |          |1 = UART1 clock Enabled.
     * |[18]    |UART2CKEN |UART2 Clock Enable Control
     * |        |          |0 = UART2 clock Disabled.
     * |        |          |1 = UART2 clock Enabled.
     * |[19]    |UART3CKEN |UART3 Clock Enable Control
     * |        |          |0 = UART3 clock Disabled.
     * |        |          |1 = UART3 clock Enabled.
     * |[20]    |UART4CKEN |UART4 Clock Enable Control
     * |        |          |0 = UART4 clock Disabled.
     * |        |          |1 = UART4 clock Enabled.
     * |[21]    |UART5CKEN |UART5 Clock Enable Control
     * |        |          |0 = UART5 clock Disabled.
     * |        |          |1 = UART5 clock Enabled.
     * |[24]    |CAN0CKEN  |CAN Bus Controller-0 Clock Enable Control
     * |        |          |0 = CAN0 clock Disabled.
     * |        |          |1 = CAN0 clock Enabled.
     * |[25]    |CAN1CKEN  |CAN Bus Controller-1 Clock Enable Control
     * |        |          |0 = CAN1 clock Disabled.
     * |        |          |1 = CAN1 clock Enabled.
     * |[26]    |OTGCKEN   |USB 2.0 OTG Device Controller Clock Enable Control
     * |        |          |0 = OTG clock Disabled.
     * |        |          |1 = OTG clock Enabled.
     * |[28]    |ADCCKEN   |Analog-Digital-Converter (ADC) Clock Enable Control
     * |        |          |0 = ADC clock Disabled.
     * |        |          |1 = ADC clock Enabled.
     * |[29]    |I2S0CKEN  |I2S0 Clock Enable Control
     * |        |          |0 = I2S Clock Disabled.
     * |        |          |1 = I2S Clock Enabled.
     * |[30]    |I2S1CKEN  |I2S1 Clock Enable Control
     * |        |          |0 = I2S1 Clock Disabled.
     * |        |          |1 = I2S1 Clock Enabled.
     * |[31]    |PS2CKEN   |PS/2 Clock Enable Control
     * |        |          |0 = PS/2 clock Disabled.
     * |        |          |1 = PS/2 clock Enabled.
    */
    __IO uint32_t APBCLK0;

    /**
     * APBCLK1
     * ===================================================================================================
     * Offset: 0x0C  APB Devices Clock Enable Control Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SC0CKEN   |SC0 Clock Enable Control
     * |        |          |0 = SC0 Clock Disabled.
     * |        |          |1 = SC0 Clock Enabled.
     * |[1]     |SC1CKEN   |SC1 Clock Enable Control
     * |        |          |0 = SC1 Clock Disabled.
     * |        |          |1 = SC1 Clock Enabled.
     * |[2]     |SC2CKEN   |SC2 Clock Enable Control
     * |        |          |0 = SC2 Clock Disabled.
     * |        |          |1 = SC2 Clock Enabled.
     * |[3]     |SC3CKEN   |SC3 Clock Enable Control
     * |        |          |0 = SC3 Clock Disabled.
     * |        |          |1 = SC3 Clock Enabled.
     * |[4]     |SC4CKEN   |SC4 Clock Enable Control
     * |        |          |0 = SC4 Clock Disabled.
     * |        |          |1 = SC4 Clock Enabled.
     * |[5]     |SC5CKEN   |SC5 Clock Enable Control
     * |        |          |0 = SC5 Clock Disabled.
     * |        |          |1 = SC5 Clock Enabled.
     * |[8]     |I2C4CKEN  |I2C4 Clock Enable Control
     * |        |          |0 = I2C4 Clock Disabled.
     * |        |          |1 = I2C4 Clock Enabled.
     * |[16]    |PWM0CH01CKEN|PWM0_01 Clock Enable Control
     * |        |          |0 = PWM0_01 Clock Disabled.
     * |        |          |1 = PWM0_01 Clock Enabled.
     * |[17]    |PWM0CH23CKEN|PWM0_23 Clock Enable Control
     * |        |          |0 = PWM0_23 Clock Disabled.
     * |        |          |1 = PWM0_23 Clock Enabled.
     * |[18]    |PWM0CH45CKEN|PWM0_45 Clock Enable Control
     * |        |          |0 = PWM0_45 Clock Disabled.
     * |        |          |1 = PWM0_45 Clock Enabled.
     * |[19]    |PWM1CH01CKEN|PWM1_01 Clock Enable Control
     * |        |          |0 = PWM1_01 Clock Disabled.
     * |        |          |1 = PWM1_01 Clock Enabled.
     * |[21]    |PWM1CH2345CKEN|PWM1_2345 Clock Enable Control
     * |        |          |0 = PWM1_2345 Clock Disabled.
     * |        |          |1 = PWM1_2345 Clock Enabled.
     * |[22]    |QEI0CKEN  |Quadrature Encoder Interface (QEI0) Clock Enable Control
     * |        |          |0 = QEI0 clock Disabled.
     * |        |          |1 = QEI0 clock Enabled.
     * |[23]    |QEI1CKEN  |Quadrature Encoder Interface (QEI1) Clock Enable Control
     * |        |          |0 = QEI1 clock Disabled.
     * |        |          |1 = QEI1 clock Enabled.
     * |[26]    |ECAP0CKEN |Enhance CAP (ECAP0) Clock Enable Control
     * |        |          |0 = ECAP0 clock Disabled.
     * |        |          |1 = ECAP0 clock Enabled.
     * |[27]    |ECAP1CKEN |Enhance CAP (ECAP1) Clock Enable Control
     * |        |          |0 = ECAP1 clock Disabled.
     * |        |          |1 = ECAP1 clock Enabled.
     * |[28]    |EPWM0CKEN |Enhance PWM0 (EPWM) Clock Enable Control
     * |        |          |0 = EPWM0 clock Disabled.
     * |        |          |1 = EPWM0 clock Enabled.
     * |[29]    |EPWM1CKEN |Enhance PWM1 (EPWM) Clock Enable Control
     * |        |          |0 = EPWM1 clock Disabled.
     * |        |          |1 = EPWM1 clock Enabled.
     * |[30]    |OPACKEN   |OP Amplifier (OPA) Clock Enable Control
     * |        |          |0 = OPA clock Disabled.
     * |        |          |1 = OPA clock Enabled.
     * |[31]    |EADCCKEN  |Enhance Analog-Digital-Converter (E ADC) Clock Enable Control
     * |        |          |0 = EADC clock Disabled.
     * |        |          |1 = EADC clock Enabled.
    */
    __IO uint32_t APBCLK1;

