RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
    /**
     * CLKSEL0
     * ===================================================================================================
     * Offset: 0x10  Clock Source Select Control Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:2]   |HCLKSEL   |HCLK Clock Source Selection (Write Protect)
     * |        |          |Before clock switching, the related clock sources (both pre-select and new-select) must be turned on
     * |        |          |1.
     * |        |          |The 3-bit default value is reloaded from the value of CFOSC (Config0[26:24]) in user configuration register of Flash controller by any reset.
     * |        |          |Therefore the default value is either 000b or 111b.
     * |        |          |2.
     * |        |          |These bits are protected bit, it means programming this bit needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PLL clock.
     * |        |          |011 = Clock source from LIRC clock.
     * |        |          |100 = Clock source from PLL2 clock.
     * |        |          |111 = Clock source from HIRC clock.
     * |        |          |Other = Reserved.
     * |[3:5]   |STCLKSEL  |Cortex(TM)-M4 SysTick Clock Source Selection (Write Protect)
     * |        |          |If SYST_CSR[2]=0, SysTick uses listed clock source below.
     * |        |          |These bits are protected bit.
     * |        |          |It means programming this bit needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from HXT clock/2.
     * |        |          |011 = Clock source from HCLK/2.
     * |        |          |111 = Clock source from HIRC clock/2.
     * |[6]     |PCLKSEL   |PCLK Clock Source Selection (Write Protect)
     * |        |          |These bits are protected bit.
     * |        |          |It means programming this bit needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |0 = Clock source from HCLK.
     * |        |          |1 = Clock source from HCLK/2.
     * |[8]     |USBHSEL   |USB Host Clock Source Selection (Write Protect)
     * |        |          |These bits are protected bit.
     * |        |          |It means programming this bit needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |0 = Clock source from PLL2.
     * |        |          |1 = Clock source from PLL.
     * |[16:17] |CAPSEL    |Image Capture Interface Clock Source Selection
     * |        |          |These bits are protected bit.
     * |        |          |It means programming this bit needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = Clock source from HCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[20:21] |SDHSEL    |SDHOST Engine Clock Source Selection
     * |        |          |These bits are protected bit.
     * |        |          |It means programming this bit needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = Clock source from HCLK.
     * |        |          |11 = Clock source from HIRC clock.
    */
    __IO uint32_t CLKSEL0;

    /**
     * CLKSEL1
     * ===================================================================================================
     * Offset: 0x14  Clock Source Select Control Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |WDTSEL    |Watchdog Timer Clock Source Selection (Write Protect)
     * |        |          |These bits are protected bit,and programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |00 = Clock source from 4~24 MHz external high-speed crystal clock.
     * |        |          |01 = Clock source from LXT clock.
     * |        |          |10 = Clock source from HCLK/2048 clock.
     * |        |          |11 = Clock source from LIRC clock.
     * |[2:3]   |EADCSEL   |ADC Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = Clock source from PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[4]     |SPI0SEL   |SPI0 Clock Source Selection
     * |        |          |0 = Clock source from PLL clock.
     * |        |          |1 = Clock source from PCLK.
     * |[5]     |SPI1SEL   |SPI1 Clock Source Selection
     * |        |          |0 = Clock source from PLL clock.
     * |        |          |1 = Clock source from PCLK.
     * |[6]     |SPI2SEL   |SPI2 Clock Source Selection
     * |        |          |0 = Clock source from PLL clock.
     * |        |          |1 = Clock source from PCLK.
     * |[7]     |SPI3SEL   |SPI3 Clock Source Selection
     * |        |          |0 = Clock source from PLL clock.
     * |        |          |1 = Clock source from PCLK.
     * |[8:10]  |TMR0SEL   |TIMER0 Clock Source Selection
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from external trigger.
     * |        |          |101 = Clock source from LIRC clock.
     * |        |          |111 = Clock source from HIRC clock.
     * |        |          |Others = reserved.
     * |[12:14] |TMR1SEL   |TIMER1 Clock Source Selection
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from external trigger.
     * |        |          |101 = Clock source from LIRC clock.
     * |        |          |111 = Clock source from HIRC clock.
     * |        |          |Others = reserved.
     * |[16:18] |TMR2SEL   |TIMER2 Clock Source Selection
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from external trigger.
     * |        |          |101 = Clock source from LIRC clock.
     * |        |          |111 = Clock source from HIRC clock.
     * |        |          |Others = reserved.
     * |[20:22] |TMR3SEL   |TIMER3 Clock Source Selection
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from external trigger.
     * |        |          |101 = Clock source from LIRC clock.
     * |        |          |111 = Clock source from HIRC clock.
     * |        |          |Others = reserved.
     * |[24:25] |UARTSEL   |UART Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10/11 = Clock source from HIRC clock.
     * |[28:29] |CLKOSEL   |Clock Divider Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from LXT clock.
     * |        |          |10 = Clock source from HCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[30:31] |WWDTSEL   |Window Watchdog Timer Clock Source Selection
     * |        |          |00 = Reserved.
     * |        |          |01 = Reserved.
     * |        |          |10 = Clock source from HCLK/2048 clock.
     * |        |          |11 = Clock source from LIRC clock.
    */
    __IO uint32_t CLKSEL1;

    /**
     * CLKSEL2
     * ===================================================================================================
     * Offset: 0x18  Clock Source Select Control Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:2]   |PWM0CH01SEL|PWM0_0 And PWM0_1 Clock Source Selection
     * |        |          |PWM0_0 and PWM0_1 uses the same Engine clock source, both of them use the same prescaler.
     * |        |          |The Engine clock source of PWM0_0 and PWM0_1 is defined by PWM0CH01SEL[2:0].
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from HIRC clock.
     * |        |          |100 = Clock source from LIRC clock.
     * |        |          |Other = Reserved.
     * |[4:6]   |PPWM0CH23SEL|PWM0_2 And PWM0_3 Clock Source Selection
     * |        |          |PWM0_2 and PWM0_3 uses the same Engine clock source, both of them use the same prescaler.
     * |        |          |The Engine clock source of PWM0_2 and PWM0_3 is defined by PPWM0CH23SEL[2:0].
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from HIRC clock.
     * |        |          |100 = Clock source from LIRC clock.
     * |        |          |Other = Reserved.
     * |[8:10]  |PWM0CH45SEL|PWM0_4 And PWM0_5 Clock Source Selection
     * |        |          |PWM0_4 and PWM0_5 used the same Engine clock source; both of them use the same prescaler.
     * |        |          |The Engine clock source of PWM0_4 and PWM0_5 is defined by PWM0CH45SEL[2:0].
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from HIRC clock.
     * |        |          |100 = Clock source from LIRC clock.
     * |        |          |Other = Reserved.
     * |[12:14] |PWM1CH01SEL|PWM1_0 And PWM1_1 Clock Source Selection
     * |        |          |PWM1_0 and PWM1_1 uses the same Engine clock source, both of them use the same prescaler.
     * |        |          |The Engine clock source of PWM1_0 and PWM1_1 is defined by PWM1CH01SEL[2:0].
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from HIRC clock.
     * |        |          |100 = Clock source from LIRC clock.
     * |        |          |Other = Reserved.
     * |[16:18] |PWM1CH23SEL|PWM1_2 And PWM1_3 Clock Source Selection
     * |        |          |PWM1_2 and PWM1_3 uses the same Engine clock source, both of them use the same prescaler.
     * |        |          |The Engine clock source of PWM1_2 and PWM1_3 is defined by PWM1CH23SEL[2:0].
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from HIRC clock.
     * |        |          |100= Clock source from LIRC clock.
     * |        |          |Other = Reserved.
     * |[20:22] |PWM1CH45SEL|PWM1_4 And PWM1_5 Clock Source Selection
     * |        |          |PWM1_4 and PWM1_5 used the same Engine clock source; both of them use the same prescaler.
     * |        |          |The Engine clock source of PWM1_4 and PWM1_5 is defined by PWM1CH45SEL[2:0].
     * |        |          |000 = Clock source from HXT clock.
     * |        |          |001 = Clock source from LXT clock.
     * |        |          |010 = Clock source from PCLK.
     * |        |          |011 = Clock source from HIRC clock.
     * |        |          |100 = Clock source from LIRC clock.
     * |        |          |Other = Reserved.
    */
    __IO uint32_t CLKSEL2;

    /**
     * CLKSEL3
     * ===================================================================================================
     * Offset: 0x1C  Clock Source Select Control Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |SC0SEL    |SC0 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[2:3]   |SC1SEL    |SC1 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[4:5]   |SC2SEL    |SC2 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[6:7]   |SC3SEL    |SC3 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[8:9]   |SC4SEL    |SC4 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[10:11] |SC5SEL    |SC5 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[16:17] |I2S0SEL   |I2S0 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = Clock source from PCLK.
     * |        |          |11 = Clock source from HIRC clock.
     * |[18:19] |I2S1SEL   |I2S1 Clock Source Selection
     * |        |          |00 = Clock source from HXT clock.
     * |        |          |01 = Clock source from PLL clock.
     * |        |          |10 = Clock source from PCLK.
     * |        |          |11 = Clock source from HIRC clock.
    */
    __IO uint32_t CLKSEL3;

    /**
     * CLKDIV0
     * ===================================================================================================
     * Offset: 0x20  Clock Divider Number Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |HCLKDIV   |HCLK Clock Divide Number From HCLK Clock Source
     * |        |          |HCLK clock frequency = (HCLK clock source frequency) / (HCLKDIV + 1).
     * |[4:7]   |USBHDIV   |USB Host Clock Divide Number From PLL Clock
     * |        |          |USB Host clock frequency = (PLL frequency) / (USBHDIV + 1).
     * |[8:11]  |UARTDIV   |UART Clock Divide Number From UART Clock Source
     * |        |          |UART clock frequency = (UART clock source frequency) / (UARTDIV + 1).
     * |[16:23] |ADCDIV    |ADC Clock Divide Number From ADC Clock Source
     * |        |          |ADC clock frequency = (ADC clock source frequency) / (ADCDIV + 1).
     * |[24:31] |SDHDIV    |SDHOST Clock Divide Number From SDHOST Clock Source
     * |        |          |SDHOST clock frequency = (SDHOST clock source frequency) / (SDHDIV + 1).
    */
    __IO uint32_t CLKDIV0;

    /**
     * CLKDIV1
     * ===================================================================================================
     * Offset: 0x24  Clock Divider Number Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |SC0DIV    |SC0 Clock Divide Number From SC0 Clock Source
     * |        |          |SC0 clock frequency = (SC0 clock source frequency ) / (SC0DIV+ 1).
     * |[8:15]  |SC1DIV    |SC1 Clock Divide Number From SC1 Clock Source
     * |        |          |SC1 clock frequency = (SC1 clock source frequency ) / (SC1DIV + 1).
     * |[16:23] |SC2DIV    |SC2 Clock Divide Number From SC2 Clock Source
     * |        |          |SC2 clock frequency = (SC2 clock source frequency ) / (SC2DIV + 1).
     * |[24:31] |SC3DIV    |SC3 Clock Divide Number From SC3 Clock Source
     * |        |          |SC3 clock frequency = (SC3 clock source frequency ) / (SC3DIV+ 1).
    */
    __IO uint32_t CLKDIV1;

    /**
     * CLKDIV2
     * ===================================================================================================
     * Offset: 0x28  Clock Divider Number Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |SC4DIV    |SC4 Clock Divide Number From SC4 Clock Source
     * |        |          |SC4 clock frequency = (SC4 clock source frequency ) / (SC4DIV + 1).
     * |[8:15]  |SC5DIV    |SC5 Clock Divide Number From SC5 Clock Source
     * |        |          |SC5 clock frequency = (SC5 clock source frequency ) / (SC5DIV + 1).
    */
    __IO uint32_t CLKDIV2;

    /**
     * CLKDIV3
     * ===================================================================================================
     * Offset: 0x2C  Clock Divider Number Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |CAPDIV    |Image Capture Sensor Clock Divide Number From ICAP Clock Source
     * |        |          |Image sensor clock frequency = (ICAP clock source frequency) / (ICAPDIV + 1).
     * |[8:15]  |VSENSEDIV |Video Pixel Clock Divide Number From ICAP Clock Source
     * |        |          |Video pixel clock frequency = (ICAP clock source frequency) / (VSENSEDIV + 1).
     * |[16:23] |EMACDIV   |Ethernet Clock Divide Number Form HCLK (NUC472 Only)
     * |        |          |EMAC MDCLK clock frequency = (HCLK) / (EMACDIV + 1).
    */
    __IO uint32_t CLKDIV3;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[4];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * PLLCTL
     * ===================================================================================================
     * Offset: 0x40  PLL Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:8]   |FBDIV     |PLL Feedback Divider Control Pins
     * |        |          |Refer to the formulas below the table.
     * |[9:13]  |INDIV     |PLL Input Divider Control Pins
     * |        |          |Refer to the formulas below the table.
     * |[14:15] |OUTDV     |PLL Output Divider Control Pins
     * |        |          |Refer to the formulas below the table.
     * |[16]    |PD        |Power-Down Mode
     * |        |          |If set the PWR_DOWN_EN bit to 1 in CLK_PWRCTL register, the PLL will enter Power-down mode, too.
     * |        |          |0 = PLL is in normal mode.
     * |        |          |1 = PLL is in Power-down mode (default).
     * |[17]    |BP        |PLL Bypass Control
     * |        |          |0 = PLL is in normal mode (default).
     * |        |          |1 = PLL clock output is same as clock input (XTALin).
     * |[18]    |OE        |PLL OE (FOUT Enable) Pin Control
     * |        |          |0 = PLL FOUT Enabled.
     * |        |          |1 = PLL FOUT is fixed low.
     * |[19]    |PLLSRC    |PLL Source Clock Selection
     * |        |          |0 = PLL source clock from HXT.
     * |        |          |1 = PLL source clock from HIRC.
     * |[20]    |PLLREMAP  |PLL Remap Enable Bit
     * |        |          |0 = PLL remap enable.
     * |        |          |1 = PLL remap disable.
    */
    __IO uint32_t PLLCTL;

    /**
     * PLL2CTL
     * ===================================================================================================
     * Offset: 0x44  PLL2 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |PLL2DIV   |PLL2 Divider Control
     * |        |          |PLL2 clock frequency = (480 MHz) / 2 / (PLL2DIV + 1).
     * |        |          |Note: Max. PLL frequency 240 MHz when XTL12M.
     * |[8]     |PLL2CKEN  |USB OHY 480 MHz Enable Control
     * |        |          |This bit enables USB PHY PLL (480 MHz), and user needs to care extend 12 MHz source.
     * |        |          |0 = USB PHY PLL (480 MHz) Disabled.
     * |        |          |1 = USB PHY PLL (480 MHz) Enabled.
    */
    __IO uint32_t PLL2CTL;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[2];
    /// @endcond //HIDDEN_SYMBOLS


