RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define CLK_APBCLK1_PWM0CH23CKEN_Pos     (17)                                              /*!< CLK_T::APBCLK1: PWM0CH23CKEN Position     */
#define CLK_APBCLK1_PWM0CH23CKEN_Msk     (0x1ul << CLK_APBCLK1_PWM0CH23CKEN_Pos)           /*!< CLK_T::APBCLK1: PWM0CH23CKEN Mask         */

#define CLK_APBCLK1_PWM0CH45CKEN_Pos     (18)                                              /*!< CLK_T::APBCLK1: PWM0CH45CKEN Position     */
#define CLK_APBCLK1_PWM0CH45CKEN_Msk     (0x1ul << CLK_APBCLK1_PWM0CH45CKEN_Pos)           /*!< CLK_T::APBCLK1: PWM0CH45CKEN Mask         */

#define CLK_APBCLK1_PWM1CH01CKEN_Pos     (19)                                              /*!< CLK_T::APBCLK1: PWM1CH01CKEN Position     */
#define CLK_APBCLK1_PWM1CH01CKEN_Msk     (0x1ul << CLK_APBCLK1_PWM1CH01CKEN_Pos)           /*!< CLK_T::APBCLK1: PWM1CH01CKEN Mask         */

#define CLK_APBCLK1_PWM1CH2345CKEN_Pos   (21)                                              /*!< CLK_T::APBCLK1: PWM1CH2345CKEN Position   */
#define CLK_APBCLK1_PWM1CH2345CKEN_Msk   (0x1ul << CLK_APBCLK1_PWM1CH2345CKEN_Pos)         /*!< CLK_T::APBCLK1: PWM1CH2345CKEN Mask       */

#define CLK_APBCLK1_QEI0CKEN_Pos         (22)                                              /*!< CLK_T::APBCLK1: QEI0CKEN Position         */
#define CLK_APBCLK1_QEI0CKEN_Msk         (0x1ul << CLK_APBCLK1_QEI0CKEN_Pos)               /*!< CLK_T::APBCLK1: QEI0CKEN Mask             */

#define CLK_APBCLK1_QEI1CKEN_Pos         (23)                                              /*!< CLK_T::APBCLK1: QEI1CKEN Position         */
#define CLK_APBCLK1_QEI1CKEN_Msk         (0x1ul << CLK_APBCLK1_QEI1CKEN_Pos)               /*!< CLK_T::APBCLK1: QEI1CKEN Mask             */

#define CLK_APBCLK1_ECAP0CKEN_Pos        (26)                                              /*!< CLK_T::APBCLK1: ECAP0CKEN Position        */
#define CLK_APBCLK1_ECAP0CKEN_Msk        (0x1ul << CLK_APBCLK1_ECAP0CKEN_Pos)              /*!< CLK_T::APBCLK1: ECAP0CKEN Mask            */

#define CLK_APBCLK1_ECAP1CKEN_Pos        (27)                                              /*!< CLK_T::APBCLK1: ECAP1CKEN Position        */
#define CLK_APBCLK1_ECAP1CKEN_Msk        (0x1ul << CLK_APBCLK1_ECAP1CKEN_Pos)              /*!< CLK_T::APBCLK1: ECAP1CKEN Mask            */

#define CLK_APBCLK1_EPWM0CKEN_Pos        (28)                                              /*!< CLK_T::APBCLK1: EPWM0CKEN Position        */
#define CLK_APBCLK1_EPWM0CKEN_Msk        (0x1ul << CLK_APBCLK1_EPWM0CKEN_Pos)              /*!< CLK_T::APBCLK1: EPWM0CKEN Mask            */

#define CLK_APBCLK1_EPWM1CKEN_Pos        (29)                                              /*!< CLK_T::APBCLK1: EPWM1CKEN Position        */
#define CLK_APBCLK1_EPWM1CKEN_Msk        (0x1ul << CLK_APBCLK1_EPWM1CKEN_Pos)              /*!< CLK_T::APBCLK1: EPWM1CKEN Mask            */

#define CLK_APBCLK1_OPACKEN_Pos          (30)                                              /*!< CLK_T::APBCLK1: OPACKEN Position          */
#define CLK_APBCLK1_OPACKEN_Msk          (0x1ul << CLK_APBCLK1_OPACKEN_Pos)                /*!< CLK_T::APBCLK1: OPACKEN Mask              */

#define CLK_APBCLK1_EADCCKEN_Pos         (31)                                              /*!< CLK_T::APBCLK1: EADCCKEN Position         */
#define CLK_APBCLK1_EADCCKEN_Msk         (0x1ul << CLK_APBCLK1_EADCCKEN_Pos)               /*!< CLK_T::APBCLK1: EADCCKEN Mask             */

#define CLK_CLKSEL0_HCLKSEL_Pos          (0)                                               /*!< CLK_T::CLKSEL0: HCLKSEL Position          */
#define CLK_CLKSEL0_HCLKSEL_Msk          (0x7ul << CLK_CLKSEL0_HCLKSEL_Pos)                /*!< CLK_T::CLKSEL0: HCLKSEL Mask              */

#define CLK_CLKSEL0_STCLKSEL_Pos         (3)                                               /*!< CLK_T::CLKSEL0: STCLKSEL Position         */
#define CLK_CLKSEL0_STCLKSEL_Msk         (0x7ul << CLK_CLKSEL0_STCLKSEL_Pos)               /*!< CLK_T::CLKSEL0: STCLKSEL Mask             */

#define CLK_CLKSEL0_PCLKSEL_Pos          (6)                                               /*!< CLK_T::CLKSEL0: PCLKSEL Position          */
#define CLK_CLKSEL0_PCLKSEL_Msk          (0x1ul << CLK_CLKSEL0_PCLKSEL_Pos)                /*!< CLK_T::CLKSEL0: PCLKSEL Mask              */

#define CLK_CLKSEL0_USBHSEL_Pos          (8)                                               /*!< CLK_T::CLKSEL0: USBHSEL Position          */
#define CLK_CLKSEL0_USBHSEL_Msk          (0x1ul << CLK_CLKSEL0_USBHSEL_Pos)                /*!< CLK_T::CLKSEL0: USBHSEL Mask              */

#define CLK_CLKSEL0_CAPSEL_Pos          (16)                                               /*!< CLK_T::CLKSEL0: CAPSEL Position          */
#define CLK_CLKSEL0_CAPSEL_Msk          (0x3ul << CLK_CLKSEL0_CAPSEL_Pos)                  /*!< CLK_T::CLKSEL0: CAPSEL Mask              */

#define CLK_CLKSEL0_SDHSEL_Pos           (20)                                              /*!< CLK_T::CLKSEL0: SDHSEL Position           */
#define CLK_CLKSEL0_SDHSEL_Msk           (0x3ul << CLK_CLKSEL0_SDHSEL_Pos)                 /*!< CLK_T::CLKSEL0: SDHSEL Mask               */

#define CLK_CLKSEL1_WDTSEL_Pos           (0)                                               /*!< CLK_T::CLKSEL1: WDTSEL Position           */
#define CLK_CLKSEL1_WDTSEL_Msk           (0x3ul << CLK_CLKSEL1_WDTSEL_Pos)                 /*!< CLK_T::CLKSEL1: WDTSEL Mask               */

#define CLK_CLKSEL1_ADCSEL_Pos           (2)                                               /*!< CLK_T::CLKSEL1: ADCSEL Position          */
#define CLK_CLKSEL1_ADCSEL_Msk           (0x3ul << CLK_CLKSEL1_ADCSEL_Pos)                 /*!< CLK_T::CLKSEL1: ADCSEL Mask              */

#define CLK_CLKSEL1_SPI0SEL_Pos          (4)                                               /*!< CLK_T::CLKSEL1: SPI0SEL Position          */
#define CLK_CLKSEL1_SPI0SEL_Msk          (0x1ul << CLK_CLKSEL1_SPI0SEL_Pos)                /*!< CLK_T::CLKSEL1: SPI0SEL Mask              */

#define CLK_CLKSEL1_SPI1SEL_Pos          (5)                                               /*!< CLK_T::CLKSEL1: SPI1SEL Position          */
#define CLK_CLKSEL1_SPI1SEL_Msk          (0x1ul << CLK_CLKSEL1_SPI1SEL_Pos)                /*!< CLK_T::CLKSEL1: SPI1SEL Mask              */

#define CLK_CLKSEL1_SPI2SEL_Pos          (6)                                               /*!< CLK_T::CLKSEL1: SPI2SEL Position          */
#define CLK_CLKSEL1_SPI2SEL_Msk          (0x1ul << CLK_CLKSEL1_SPI2SEL_Pos)                /*!< CLK_T::CLKSEL1: SPI2SEL Mask              */

#define CLK_CLKSEL1_SPI3SEL_Pos          (7)                                               /*!< CLK_T::CLKSEL1: SPI3SEL Position          */
#define CLK_CLKSEL1_SPI3SEL_Msk          (0x1ul << CLK_CLKSEL1_SPI3SEL_Pos)                /*!< CLK_T::CLKSEL1: SPI3SEL Mask              */

#define CLK_CLKSEL1_TMR0SEL_Pos          (8)                                               /*!< CLK_T::CLKSEL1: TMR0SEL Position          */
#define CLK_CLKSEL1_TMR0SEL_Msk          (0x7ul << CLK_CLKSEL1_TMR0SEL_Pos)                /*!< CLK_T::CLKSEL1: TMR0SEL Mask              */

#define CLK_CLKSEL1_TMR1SEL_Pos          (12)                                              /*!< CLK_T::CLKSEL1: TMR1SEL Position          */
#define CLK_CLKSEL1_TMR1SEL_Msk          (0x7ul << CLK_CLKSEL1_TMR1SEL_Pos)                /*!< CLK_T::CLKSEL1: TMR1SEL Mask              */

#define CLK_CLKSEL1_TMR2SEL_Pos          (16)                                              /*!< CLK_T::CLKSEL1: TMR2SEL Position          */
#define CLK_CLKSEL1_TMR2SEL_Msk          (0x7ul << CLK_CLKSEL1_TMR2SEL_Pos)                /*!< CLK_T::CLKSEL1: TMR2SEL Mask              */

#define CLK_CLKSEL1_TMR3SEL_Pos          (20)                                              /*!< CLK_T::CLKSEL1: TMR3SEL Position          */
#define CLK_CLKSEL1_TMR3SEL_Msk          (0x7ul << CLK_CLKSEL1_TMR3SEL_Pos)                /*!< CLK_T::CLKSEL1: TMR3SEL Mask              */

