RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define CLK_CLKSEL1_UARTSEL_Pos          (24)                                              /*!< CLK_T::CLKSEL1: UARTSEL Position          */
#define CLK_CLKSEL1_UARTSEL_Msk          (0x3ul << CLK_CLKSEL1_UARTSEL_Pos)                /*!< CLK_T::CLKSEL1: UARTSEL Mask              */

#define CLK_CLKSEL1_CLKOSEL_Pos          (28)                                              /*!< CLK_T::CLKSEL1: CLKOSEL Position          */
#define CLK_CLKSEL1_CLKOSEL_Msk          (0x3ul << CLK_CLKSEL1_CLKOSEL_Pos)                /*!< CLK_T::CLKSEL1: CLKOSEL Mask              */

#define CLK_CLKSEL1_WWDTSEL_Pos          (30)                                              /*!< CLK_T::CLKSEL1: WWDTSEL Position          */
#define CLK_CLKSEL1_WWDTSEL_Msk          (0x3ul << CLK_CLKSEL1_WWDTSEL_Pos)                /*!< CLK_T::CLKSEL1: WWDTSEL Mask              */

#define CLK_CLKSEL2_PWM0CH01SEL_Pos      (0)                                               /*!< CLK_T::CLKSEL2: PWM0CH01SEL Position      */
#define CLK_CLKSEL2_PWM0CH01SEL_Msk      (0x7ul << CLK_CLKSEL2_PWM0CH01SEL_Pos)            /*!< CLK_T::CLKSEL2: PWM0CH01SEL Mask          */

#define CLK_CLKSEL2_PWM0CH23SEL_Pos      (4)                                               /*!< CLK_T::CLKSEL2: PWM0CH23SEL Position     */
#define CLK_CLKSEL2_PWM0CH23SEL_Msk      (0x7ul << CLK_CLKSEL2_PWM0CH23SEL_Pos)            /*!< CLK_T::CLKSEL2: PWM0CH23SEL Mask         */

#define CLK_CLKSEL2_PWM0CH45SEL_Pos      (8)                                               /*!< CLK_T::CLKSEL2: PWM0CH45SEL Position      */
#define CLK_CLKSEL2_PWM0CH45SEL_Msk      (0x7ul << CLK_CLKSEL2_PWM0CH45SEL_Pos)            /*!< CLK_T::CLKSEL2: PWM0CH45SEL Mask          */

#define CLK_CLKSEL2_PWM1CH01SEL_Pos      (12)                                              /*!< CLK_T::CLKSEL2: PWM1CH01SEL Position      */
#define CLK_CLKSEL2_PWM1CH01SEL_Msk      (0x7ul << CLK_CLKSEL2_PWM1CH01SEL_Pos)            /*!< CLK_T::CLKSEL2: PWM1CH01SEL Mask          */

#define CLK_CLKSEL2_PWM1CH23SEL_Pos      (16)                                              /*!< CLK_T::CLKSEL2: PWM1CH23SEL Position      */
#define CLK_CLKSEL2_PWM1CH23SEL_Msk      (0x7ul << CLK_CLKSEL2_PWM1CH23SEL_Pos)            /*!< CLK_T::CLKSEL2: PWM1CH23SEL Mask          */

#define CLK_CLKSEL2_PWM1CH45SEL_Pos      (20)                                              /*!< CLK_T::CLKSEL2: PWM1CH45SEL Position      */
#define CLK_CLKSEL2_PWM1CH45SEL_Msk      (0x7ul << CLK_CLKSEL2_PWM1CH45SEL_Pos)            /*!< CLK_T::CLKSEL2: PWM1CH45SEL Mask          */

#define CLK_CLKSEL3_SC0SEL_Pos           (0)                                               /*!< CLK_T::CLKSEL3: SC0SEL Position           */
#define CLK_CLKSEL3_SC0SEL_Msk           (0x3ul << CLK_CLKSEL3_SC0SEL_Pos)                 /*!< CLK_T::CLKSEL3: SC0SEL Mask               */

#define CLK_CLKSEL3_SC1SEL_Pos           (2)                                               /*!< CLK_T::CLKSEL3: SC1SEL Position           */
#define CLK_CLKSEL3_SC1SEL_Msk           (0x3ul << CLK_CLKSEL3_SC1SEL_Pos)                 /*!< CLK_T::CLKSEL3: SC1SEL Mask               */

#define CLK_CLKSEL3_SC2SEL_Pos           (4)                                               /*!< CLK_T::CLKSEL3: SC2SEL Position           */
#define CLK_CLKSEL3_SC2SEL_Msk           (0x3ul << CLK_CLKSEL3_SC2SEL_Pos)                 /*!< CLK_T::CLKSEL3: SC2SEL Mask               */

#define CLK_CLKSEL3_SC3SEL_Pos           (6)                                               /*!< CLK_T::CLKSEL3: SC3SEL Position           */
#define CLK_CLKSEL3_SC3SEL_Msk           (0x3ul << CLK_CLKSEL3_SC3SEL_Pos)                 /*!< CLK_T::CLKSEL3: SC3SEL Mask               */

#define CLK_CLKSEL3_SC4SEL_Pos           (8)                                               /*!< CLK_T::CLKSEL3: SC4SEL Position           */
#define CLK_CLKSEL3_SC4SEL_Msk           (0x3ul << CLK_CLKSEL3_SC4SEL_Pos)                 /*!< CLK_T::CLKSEL3: SC4SEL Mask               */

#define CLK_CLKSEL3_SC5SEL_Pos           (10)                                              /*!< CLK_T::CLKSEL3: SC5SEL Position           */
#define CLK_CLKSEL3_SC5SEL_Msk           (0x3ul << CLK_CLKSEL3_SC5SEL_Pos)                 /*!< CLK_T::CLKSEL3: SC5SEL Mask               */

#define CLK_CLKSEL3_I2S0SEL_Pos          (16)                                              /*!< CLK_T::CLKSEL3: I2S0SEL Position          */
#define CLK_CLKSEL3_I2S0SEL_Msk          (0x3ul << CLK_CLKSEL3_I2S0SEL_Pos)                /*!< CLK_T::CLKSEL3: I2S0SEL Mask              */

#define CLK_CLKSEL3_I2S1SEL_Pos          (18)                                              /*!< CLK_T::CLKSEL3: I2S1SEL Position          */
#define CLK_CLKSEL3_I2S1SEL_Msk          (0x3ul << CLK_CLKSEL3_I2S1SEL_Pos)                /*!< CLK_T::CLKSEL3: I2S1SEL Mask              */

#define CLK_CLKDIV0_HCLKDIV_Pos          (0)                                               /*!< CLK_T::CLKDIV0: HCLKDIV Position          */
#define CLK_CLKDIV0_HCLKDIV_Msk          (0xful << CLK_CLKDIV0_HCLKDIV_Pos)                /*!< CLK_T::CLKDIV0: HCLKDIV Mask              */

#define CLK_CLKDIV0_USBHDIV_Pos          (4)                                               /*!< CLK_T::CLKDIV0: USBHDIV Position          */
#define CLK_CLKDIV0_USBHDIV_Msk          (0xful << CLK_CLKDIV0_USBHDIV_Pos)                /*!< CLK_T::CLKDIV0: USBHDIV Mask              */

#define CLK_CLKDIV0_UARTDIV_Pos          (8)                                               /*!< CLK_T::CLKDIV0: UARTDIV Position          */
#define CLK_CLKDIV0_UARTDIV_Msk          (0xful << CLK_CLKDIV0_UARTDIV_Pos)                /*!< CLK_T::CLKDIV0: UARTDIV Mask              */

#define CLK_CLKDIV0_ADCDIV_Pos           (16)                                              /*!< CLK_T::CLKDIV0: ADCDIV Position           */
#define CLK_CLKDIV0_ADCDIV_Msk           (0xfful << CLK_CLKDIV0_ADCDIV_Pos)                /*!< CLK_T::CLKDIV0: ADCDIV Mask               */

#define CLK_CLKDIV0_SDHDIV_Pos           (24)                                              /*!< CLK_T::CLKDIV0: SDHDIV Position           */
#define CLK_CLKDIV0_SDHDIV_Msk           (0xfful << CLK_CLKDIV0_SDHDIV_Pos)                /*!< CLK_T::CLKDIV0: SDHDIV Mask               */

#define CLK_CLKDIV1_SC0DIV_Pos           (0)                                               /*!< CLK_T::CLKDIV1: SC0DIV Position           */
#define CLK_CLKDIV1_SC0DIV_Msk           (0xfful << CLK_CLKDIV1_SC0DIV_Pos)                /*!< CLK_T::CLKDIV1: SC0DIV Mask               */

#define CLK_CLKDIV1_SC1DIV_Pos           (8)                                               /*!< CLK_T::CLKDIV1: SC1DIV Position           */
#define CLK_CLKDIV1_SC1DIV_Msk           (0xfful << CLK_CLKDIV1_SC1DIV_Pos)                /*!< CLK_T::CLKDIV1: SC1DIV Mask               */

#define CLK_CLKDIV1_SC2DIV_Pos           (16)                                              /*!< CLK_T::CLKDIV1: SC2DIV Position           */
#define CLK_CLKDIV1_SC2DIV_Msk           (0xfful << CLK_CLKDIV1_SC2DIV_Pos)                /*!< CLK_T::CLKDIV1: SC2DIV Mask               */

#define CLK_CLKDIV1_SC3DIV_Pos           (24)                                              /*!< CLK_T::CLKDIV1: SC3DIV Position           */
#define CLK_CLKDIV1_SC3DIV_Msk           (0xfful << CLK_CLKDIV1_SC3DIV_Pos)                /*!< CLK_T::CLKDIV1: SC3DIV Mask               */

