RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define CRPT_AES_CTL_KEYPRT_Pos          (31)                                              /*!< CRPT_T::AES_CTL: KEYPRT Position          */
#define CRPT_AES_CTL_KEYPRT_Msk          (0x1ul << CRPT_AES_CTL_KEYPRT_Pos)                /*!< CRPT_T::AES_CTL: KEYPRT Mask              */

#define CRPT_AES_STS_BUSY_Pos            (0)                                               /*!< CRPT_T::AES_STS: BUSY Position            */
#define CRPT_AES_STS_BUSY_Msk            (0x1ul << CRPT_AES_STS_BUSY_Pos)                  /*!< CRPT_T::AES_STS: BUSY Mask                */

#define CRPT_AES_STS_INBUFEMPTY_Pos      (8)                                               /*!< CRPT_T::AES_STS: INBUFEMPTY Position      */
#define CRPT_AES_STS_INBUFEMPTY_Msk      (0x1ul << CRPT_AES_STS_INBUFEMPTY_Pos)            /*!< CRPT_T::AES_STS: INBUFEMPTY Mask          */

#define CRPT_AES_STS_INBUFFULL_Pos       (9)                                               /*!< CRPT_T::AES_STS: INBUFFULL Position       */
#define CRPT_AES_STS_INBUFFULL_Msk       (0x1ul << CRPT_AES_STS_INBUFFULL_Pos)             /*!< CRPT_T::AES_STS: INBUFFULL Mask           */

#define CRPT_AES_STS_INBUFERR_Pos        (10)                                              /*!< CRPT_T::AES_STS: INBUFERR Position        */
#define CRPT_AES_STS_INBUFERR_Msk        (0x1ul << CRPT_AES_STS_INBUFERR_Pos)              /*!< CRPT_T::AES_STS: INBUFERR Mask            */

#define CRPT_AES_STS_CNTERR_Pos          (12)                                              /*!< CRPT_T::AES_STS: CNTERR Position          */
#define CRPT_AES_STS_CNTERR_Msk          (0x1ul << CRPT_AES_STS_CNTERR_Pos)                /*!< CRPT_T::AES_STS: CNTERR Mask              */

#define CRPT_AES_STS_OUTBUFEMPTY_Pos     (16)                                              /*!< CRPT_T::AES_STS: OUTBUFEMPTY Position     */
#define CRPT_AES_STS_OUTBUFEMPTY_Msk     (0x1ul << CRPT_AES_STS_OUTBUFEMPTY_Pos)           /*!< CRPT_T::AES_STS: OUTBUFEMPTY Mask         */

#define CRPT_AES_STS_OUTBUFFULL_Pos      (17)                                              /*!< CRPT_T::AES_STS: OUTBUFFULL Position      */
#define CRPT_AES_STS_OUTBUFFULL_Msk      (0x1ul << CRPT_AES_STS_OUTBUFFULL_Pos)            /*!< CRPT_T::AES_STS: OUTBUFFULL Mask          */

#define CRPT_AES_STS_OUTBUFERR_Pos       (18)                                              /*!< CRPT_T::AES_STS: OUTBUFERR Position       */
#define CRPT_AES_STS_OUTBUFERR_Msk       (0x1ul << CRPT_AES_STS_OUTBUFERR_Pos)             /*!< CRPT_T::AES_STS: OUTBUFERR Mask           */

#define CRPT_AES_STS_BUSERR_Pos          (20)                                              /*!< CRPT_T::AES_STS: BUSERR Position          */
#define CRPT_AES_STS_BUSERR_Msk          (0x1ul << CRPT_AES_STS_BUSERR_Pos)                /*!< CRPT_T::AES_STS: BUSERR Mask              */

#define CRPT_AES_DATIN_DATIN_Pos         (0)                                               /*!< CRPT_T::AES_DATIN: DATIN Position         */
#define CRPT_AES_DATIN_DATIN_Msk         (0xfffffffful << CRPT_AES_DATIN_DATIN_Pos)        /*!< CRPT_T::AES_DATIN: DATIN Mask             */

#define CRPT_AES_DATOUT_DATOUT_Pos       (0)                                               /*!< CRPT_T::AES_DATOUT: DATOUT Position       */
#define CRPT_AES_DATOUT_DATOUT_Msk       (0xfffffffful << CRPT_AES_DATOUT_DATOUT_Pos)      /*!< CRPT_T::AES_DATOUT: DATOUT Mask           */

#define CRPT_AES0_KEY0_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY0: KEY Position           */
#define CRPT_AES0_KEY0_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY0_KEY_Pos)          /*!< CRPT_T::AES0_KEY0: KEY Mask               */

#define CRPT_AES0_KEY1_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY1: KEY Position           */
#define CRPT_AES0_KEY1_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY1_KEY_Pos)          /*!< CRPT_T::AES0_KEY1: KEY Mask               */

#define CRPT_AES0_KEY2_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY2: KEY Position           */
#define CRPT_AES0_KEY2_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY2_KEY_Pos)          /*!< CRPT_T::AES0_KEY2: KEY Mask               */

#define CRPT_AES0_KEY3_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY3: KEY Position           */
#define CRPT_AES0_KEY3_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY3_KEY_Pos)          /*!< CRPT_T::AES0_KEY3: KEY Mask               */

#define CRPT_AES0_KEY4_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY4: KEY Position           */
#define CRPT_AES0_KEY4_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY4_KEY_Pos)          /*!< CRPT_T::AES0_KEY4: KEY Mask               */

#define CRPT_AES0_KEY5_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY5: KEY Position           */
#define CRPT_AES0_KEY5_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY5_KEY_Pos)          /*!< CRPT_T::AES0_KEY5: KEY Mask               */

#define CRPT_AES0_KEY6_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY6: KEY Position           */
#define CRPT_AES0_KEY6_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY6_KEY_Pos)          /*!< CRPT_T::AES0_KEY6: KEY Mask               */

#define CRPT_AES0_KEY7_KEY_Pos           (0)                                               /*!< CRPT_T::AES0_KEY7: KEY Position           */
#define CRPT_AES0_KEY7_KEY_Msk           (0xfffffffful << CRPT_AES0_KEY7_KEY_Pos)          /*!< CRPT_T::AES0_KEY7: KEY Mask               */

#define CRPT_AES0_IV0_IV_Pos             (0)                                               /*!< CRPT_T::AES0_IV0: IV Position             */
#define CRPT_AES0_IV0_IV_Msk             (0xfffffffful << CRPT_AES0_IV0_IV_Pos)            /*!< CRPT_T::AES0_IV0: IV Mask                 */

#define CRPT_AES0_IV1_IV_Pos             (0)                                               /*!< CRPT_T::AES0_IV1: IV Position             */
#define CRPT_AES0_IV1_IV_Msk             (0xfffffffful << CRPT_AES0_IV1_IV_Pos)            /*!< CRPT_T::AES0_IV1: IV Mask                 */

#define CRPT_AES0_IV2_IV_Pos             (0)                                               /*!< CRPT_T::AES0_IV2: IV Position             */
#define CRPT_AES0_IV2_IV_Msk             (0xfffffffful << CRPT_AES0_IV2_IV_Pos)            /*!< CRPT_T::AES0_IV2: IV Mask                 */

#define CRPT_AES0_IV3_IV_Pos             (0)                                               /*!< CRPT_T::AES0_IV3: IV Position             */
#define CRPT_AES0_IV3_IV_Msk             (0xfffffffful << CRPT_AES0_IV3_IV_Pos)            /*!< CRPT_T::AES0_IV3: IV Mask                 */

#define CRPT_AES0_SADDR_SADDR_Pos        (0)                                               /*!< CRPT_T::AES0_SADDR: SADDR Position        */
#define CRPT_AES0_SADDR_SADDR_Msk        (0xfffffffful << CRPT_AES0_SADDR_SADDR_Pos)       /*!< CRPT_T::AES0_SADDR: SADDR Mask            */

#define CRPT_AES0_DADDR_DADDR_Pos        (0)                                               /*!< CRPT_T::AES0_DADDR: DADDR Position        */
#define CRPT_AES0_DADDR_DADDR_Msk        (0xfffffffful << CRPT_AES0_DADDR_DADDR_Pos)       /*!< CRPT_T::AES0_DADDR: DADDR Mask            */

