RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define CRPT_AES2_KEY7_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY7: KEY Position           */
#define CRPT_AES2_KEY7_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY7_KEY_Pos)          /*!< CRPT_T::AES2_KEY7: KEY Mask               */

#define CRPT_AES2_IV0_IV_Pos             (0)                                               /*!< CRPT_T::AES2_IV0: IV Position             */
#define CRPT_AES2_IV0_IV_Msk             (0xfffffffful << CRPT_AES2_IV0_IV_Pos)            /*!< CRPT_T::AES2_IV0: IV Mask                 */

#define CRPT_AES2_IV1_IV_Pos             (0)                                               /*!< CRPT_T::AES2_IV1: IV Position             */
#define CRPT_AES2_IV1_IV_Msk             (0xfffffffful << CRPT_AES2_IV1_IV_Pos)            /*!< CRPT_T::AES2_IV1: IV Mask                 */

#define CRPT_AES2_IV2_IV_Pos             (0)                                               /*!< CRPT_T::AES2_IV2: IV Position             */
#define CRPT_AES2_IV2_IV_Msk             (0xfffffffful << CRPT_AES2_IV2_IV_Pos)            /*!< CRPT_T::AES2_IV2: IV Mask                 */

#define CRPT_AES2_IV3_IV_Pos             (0)                                               /*!< CRPT_T::AES2_IV3: IV Position             */
#define CRPT_AES2_IV3_IV_Msk             (0xfffffffful << CRPT_AES2_IV3_IV_Pos)            /*!< CRPT_T::AES2_IV3: IV Mask                 */

#define CRPT_AES2_SADDR_SADDR_Pos        (0)                                               /*!< CRPT_T::AES2_SADDR: SADDR Position        */
#define CRPT_AES2_SADDR_SADDR_Msk        (0xfffffffful << CRPT_AES2_SADDR_SADDR_Pos)       /*!< CRPT_T::AES2_SADDR: SADDR Mask            */

#define CRPT_AES2_DADDR_DADDR_Pos        (0)                                               /*!< CRPT_T::AES2_DADDR: DADDR Position        */
#define CRPT_AES2_DADDR_DADDR_Msk        (0xfffffffful << CRPT_AES2_DADDR_DADDR_Pos)       /*!< CRPT_T::AES2_DADDR: DADDR Mask            */

#define CRPT_AES2_CNT_CNT_Pos            (0)                                               /*!< CRPT_T::AES2_CNT: CNT Position            */
#define CRPT_AES2_CNT_CNT_Msk            (0xfffffffful << CRPT_AES2_CNT_CNT_Pos)           /*!< CRPT_T::AES2_CNT: CNT Mask                */

#define CRPT_AES3_KEY0_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY0: KEY Position           */
#define CRPT_AES3_KEY0_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY0_KEY_Pos)          /*!< CRPT_T::AES3_KEY0: KEY Mask               */

#define CRPT_AES3_KEY1_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY1: KEY Position           */
#define CRPT_AES3_KEY1_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY1_KEY_Pos)          /*!< CRPT_T::AES3_KEY1: KEY Mask               */

#define CRPT_AES3_KEY2_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY2: KEY Position           */
#define CRPT_AES3_KEY2_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY2_KEY_Pos)          /*!< CRPT_T::AES3_KEY2: KEY Mask               */

#define CRPT_AES3_KEY3_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY3: KEY Position           */
#define CRPT_AES3_KEY3_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY3_KEY_Pos)          /*!< CRPT_T::AES3_KEY3: KEY Mask               */

#define CRPT_AES3_KEY4_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY4: KEY Position           */
#define CRPT_AES3_KEY4_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY4_KEY_Pos)          /*!< CRPT_T::AES3_KEY4: KEY Mask               */

#define CRPT_AES3_KEY5_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY5: KEY Position           */
#define CRPT_AES3_KEY5_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY5_KEY_Pos)          /*!< CRPT_T::AES3_KEY5: KEY Mask               */

#define CRPT_AES3_KEY6_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY6: KEY Position           */
#define CRPT_AES3_KEY6_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY6_KEY_Pos)          /*!< CRPT_T::AES3_KEY6: KEY Mask               */

#define CRPT_AES3_KEY7_KEY_Pos           (0)                                               /*!< CRPT_T::AES3_KEY7: KEY Position           */
#define CRPT_AES3_KEY7_KEY_Msk           (0xfffffffful << CRPT_AES3_KEY7_KEY_Pos)          /*!< CRPT_T::AES3_KEY7: KEY Mask               */

#define CRPT_AES3_IV0_IV_Pos             (0)                                               /*!< CRPT_T::AES3_IV0: IV Position             */
#define CRPT_AES3_IV0_IV_Msk             (0xfffffffful << CRPT_AES3_IV0_IV_Pos)            /*!< CRPT_T::AES3_IV0: IV Mask                 */

#define CRPT_AES3_IV1_IV_Pos             (0)                                               /*!< CRPT_T::AES3_IV1: IV Position             */
#define CRPT_AES3_IV1_IV_Msk             (0xfffffffful << CRPT_AES3_IV1_IV_Pos)            /*!< CRPT_T::AES3_IV1: IV Mask                 */

#define CRPT_AES3_IV2_IV_Pos             (0)                                               /*!< CRPT_T::AES3_IV2: IV Position             */
#define CRPT_AES3_IV2_IV_Msk             (0xfffffffful << CRPT_AES3_IV2_IV_Pos)            /*!< CRPT_T::AES3_IV2: IV Mask                 */

#define CRPT_AES3_IV3_IV_Pos             (0)                                               /*!< CRPT_T::AES3_IV3: IV Position             */
#define CRPT_AES3_IV3_IV_Msk             (0xfffffffful << CRPT_AES3_IV3_IV_Pos)            /*!< CRPT_T::AES3_IV3: IV Mask                 */

#define CRPT_AES3_SADDR_SADDR_Pos        (0)                                               /*!< CRPT_T::AES3_SADDR: SADDR Position        */
#define CRPT_AES3_SADDR_SADDR_Msk        (0xfffffffful << CRPT_AES3_SADDR_SADDR_Pos)       /*!< CRPT_T::AES3_SADDR: SADDR Mask            */

#define CRPT_AES3_DADDR_DADDR_Pos        (0)                                               /*!< CRPT_T::AES3_DADDR: DADDR Position        */
#define CRPT_AES3_DADDR_DADDR_Msk        (0xfffffffful << CRPT_AES3_DADDR_DADDR_Pos)       /*!< CRPT_T::AES3_DADDR: DADDR Mask            */

#define CRPT_AES3_CNT_CNT_Pos            (0)                                               /*!< CRPT_T::AES3_CNT: CNT Position            */
#define CRPT_AES3_CNT_CNT_Msk            (0xfffffffful << CRPT_AES3_CNT_CNT_Pos)           /*!< CRPT_T::AES3_CNT: CNT Mask                */

