RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define EADC_AD1DAT7_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT7: VALID Position           */
#define EADC_AD1DAT7_VALID_Msk           (0x1ul << EADC_AD1DAT7_VALID_Pos)                 /*!< EADC_T::AD1DAT7: VALID Mask               */

#define EADC_CTL_ADCEN_Pos               (0)                                               /*!< EADC_T::CTL: ADCEN Position               */
#define EADC_CTL_ADCEN_Msk               (0x1ul << EADC_CTL_ADCEN_Pos)                     /*!< EADC_T::CTL: ADCEN Mask                   */

#define EADC_CTL_ADCRST_Pos              (1)                                               /*!< EADC_T::CTL: ADCRST Position              */
#define EADC_CTL_ADCRST_Msk              (0x1ul << EADC_CTL_ADCRST_Pos)                    /*!< EADC_T::CTL: ADCRST Mask                  */

#define EADC_CTL_ADCIEN0_Pos             (2)                                               /*!< EADC_T::CTL: ADCIEN0 Position             */
#define EADC_CTL_ADCIEN0_Msk             (0x1ul << EADC_CTL_ADCIEN0_Pos)                   /*!< EADC_T::CTL: ADCIEN0 Mask                 */

#define EADC_CTL_ADCIEN1_Pos             (3)                                               /*!< EADC_T::CTL: ADCIEN1 Position             */
#define EADC_CTL_ADCIEN1_Msk             (0x1ul << EADC_CTL_ADCIEN1_Pos)                   /*!< EADC_T::CTL: ADCIEN1 Mask                 */

#define EADC_CTL_ADCIEN2_Pos             (4)                                               /*!< EADC_T::CTL: ADCIEN2 Position             */
#define EADC_CTL_ADCIEN2_Msk             (0x1ul << EADC_CTL_ADCIEN2_Pos)                   /*!< EADC_T::CTL: ADCIEN2 Mask                 */

#define EADC_CTL_ADCIEN3_Pos             (5)                                               /*!< EADC_T::CTL: ADCIEN3 Position             */
#define EADC_CTL_ADCIEN3_Msk             (0x1ul << EADC_CTL_ADCIEN3_Pos)                   /*!< EADC_T::CTL: ADCIEN3 Mask                 */

#define EADC_SWTRG_SWTRG7_0_Pos          (0)                                               /*!< EADC_T::SWTRG: SWTRG7_0 Position          */
#define EADC_SWTRG_SWTRG7_0_Msk          (0xfful << EADC_SWTRG_SWTRG7_0_Pos)               /*!< EADC_T::SWTRG: SWTRG7_0 Mask              */

#define EADC_SWTRG_SWTRG15_8_Pos         (8)                                               /*!< EADC_T::SWTRG: SWTRG15_8 Position         */
#define EADC_SWTRG_SWTRG15_8_Msk         (0xfful << EADC_SWTRG_SWTRG15_8_Pos)              /*!< EADC_T::SWTRG: SWTRG15_8 Mask             */

#define EADC_PENDSTS_STPF7_0_Pos         (0)                                               /*!< EADC_T::PENDSTS: STPF7_0 Position         */
#define EADC_PENDSTS_STPF7_0_Msk         (0xfful << EADC_PENDSTS_STPF7_0_Pos)              /*!< EADC_T::PENDSTS: STPF7_0 Mask             */

#define EADC_PENDSTS_STPF15_8_Pos        (8)                                               /*!< EADC_T::PENDSTS: STPF15_8 Position        */
#define EADC_PENDSTS_STPF15_8_Msk        (0xfful << EADC_PENDSTS_STPF15_8_Pos)             /*!< EADC_T::PENDSTS: STPF15_8 Mask            */

#define EADC_ADIFOV_ADFOV0_Pos           (0)                                               /*!< EADC_T::ADIFOV: ADFOV0 Position           */
#define EADC_ADIFOV_ADFOV0_Msk           (0x1ul << EADC_ADIFOV_ADFOV0_Pos)                 /*!< EADC_T::ADIFOV: ADFOV0 Mask               */

#define EADC_ADIFOV_ADFOV1_Pos           (1)                                               /*!< EADC_T::ADIFOV: ADFOV1 Position           */
#define EADC_ADIFOV_ADFOV1_Msk           (0x1ul << EADC_ADIFOV_ADFOV1_Pos)                 /*!< EADC_T::ADIFOV: ADFOV1 Mask               */

#define EADC_ADIFOV_ADFOV2_Pos           (2)                                               /*!< EADC_T::ADIFOV: ADFOV2 Position           */
#define EADC_ADIFOV_ADFOV2_Msk           (0x1ul << EADC_ADIFOV_ADFOV2_Pos)                 /*!< EADC_T::ADIFOV: ADFOV2 Mask               */

#define EADC_ADIFOV_ADFOV3_Pos           (3)                                               /*!< EADC_T::ADIFOV: ADFOV3 Position           */
#define EADC_ADIFOV_ADFOV3_Msk           (0x1ul << EADC_ADIFOV_ADFOV3_Pos)                 /*!< EADC_T::ADIFOV: ADFOV3 Mask               */

#define EADC_OVSTS_SPOVF7_0_Pos          (0)                                               /*!< EADC_T::OVSTS: SPOVF7_0 Position          */
#define EADC_OVSTS_SPOVF7_0_Msk          (0xfful << EADC_OVSTS_SPOVF7_0_Pos)               /*!< EADC_T::OVSTS: SPOVF7_0 Mask              */

#define EADC_OVSTS_SPOVF15_8_Pos         (8)                                               /*!< EADC_T::OVSTS: SPOVF15_8 Position         */
#define EADC_OVSTS_SPOVF15_8_Msk         (0xfful << EADC_OVSTS_SPOVF15_8_Pos)              /*!< EADC_T::OVSTS: SPOVF15_8 Mask             */

#define EADC_AD0SPCTL0_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL0: CHSEL Position         */
#define EADC_AD0SPCTL0_CHSEL_Msk         (0xful << EADC_AD0SPCTL0_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL0: CHSEL Mask             */

#define EADC_AD0SPCTL0_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL0: TRGSEL Position        */
#define EADC_AD0SPCTL0_TRGSEL_Msk        (0xful << EADC_AD0SPCTL0_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL0: TRGSEL Mask            */

#define EADC_AD0SPCTL0_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD0SPCTL0: TRGDLYCNT Position     */
#define EADC_AD0SPCTL0_TRGDLYCNT_Msk     (0xfful << EADC_AD0SPCTL0_TRGDLYCNT_Pos)          /*!< EADC_T::AD0SPCTL0: TRGDLYCNT Mask         */

#define EADC_AD0SPCTL0_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD0SPCTL0: TRGDLYDIV Position     */
#define EADC_AD0SPCTL0_TRGDLYDIV_Msk     (0x3ul << EADC_AD0SPCTL0_TRGDLYDIV_Pos)           /*!< EADC_T::AD0SPCTL0: TRGDLYDIV Mask         */

#define EADC_AD0SPCTL0_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL0: EXTREN Position        */
#define EADC_AD0SPCTL0_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL0_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL0: EXTREN Mask            */

#define EADC_AD0SPCTL0_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL0: EXTFEN Position        */
#define EADC_AD0SPCTL0_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL0_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL0: EXTFEN Mask            */

