RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define EADC_AD0SPCTL1_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL1: CHSEL Position         */
#define EADC_AD0SPCTL1_CHSEL_Msk         (0xful << EADC_AD0SPCTL1_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL1: CHSEL Mask             */

#define EADC_AD0SPCTL1_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL1: TRGSEL Position        */
#define EADC_AD0SPCTL1_TRGSEL_Msk        (0xful << EADC_AD0SPCTL1_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL1: TRGSEL Mask            */

#define EADC_AD0SPCTL1_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD0SPCTL1: TRGDLYCNT Position     */
#define EADC_AD0SPCTL1_TRGDLYCNT_Msk     (0xfful << EADC_AD0SPCTL1_TRGDLYCNT_Pos)          /*!< EADC_T::AD0SPCTL1: TRGDLYCNT Mask         */

#define EADC_AD0SPCTL1_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD0SPCTL1: TRGDLYDIV Position     */
#define EADC_AD0SPCTL1_TRGDLYDIV_Msk     (0x3ul << EADC_AD0SPCTL1_TRGDLYDIV_Pos)           /*!< EADC_T::AD0SPCTL1: TRGDLYDIV Mask         */

#define EADC_AD0SPCTL1_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL1: EXTREN Position        */
#define EADC_AD0SPCTL1_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL1_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL1: EXTREN Mask            */

#define EADC_AD0SPCTL1_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL1: EXTFEN Position        */
#define EADC_AD0SPCTL1_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL1_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL1: EXTFEN Mask            */

#define EADC_AD0SPCTL2_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL2: CHSEL Position         */
#define EADC_AD0SPCTL2_CHSEL_Msk         (0xful << EADC_AD0SPCTL2_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL2: CHSEL Mask             */

#define EADC_AD0SPCTL2_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL2: TRGSEL Position        */
#define EADC_AD0SPCTL2_TRGSEL_Msk        (0xful << EADC_AD0SPCTL2_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL2: TRGSEL Mask            */

#define EADC_AD0SPCTL2_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD0SPCTL2: TRGDLYCNT Position     */
#define EADC_AD0SPCTL2_TRGDLYCNT_Msk     (0xfful << EADC_AD0SPCTL2_TRGDLYCNT_Pos)          /*!< EADC_T::AD0SPCTL2: TRGDLYCNT Mask         */

#define EADC_AD0SPCTL2_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD0SPCTL2: TRGDLYDIV Position     */
#define EADC_AD0SPCTL2_TRGDLYDIV_Msk     (0x3ul << EADC_AD0SPCTL2_TRGDLYDIV_Pos)           /*!< EADC_T::AD0SPCTL2: TRGDLYDIV Mask         */

#define EADC_AD0SPCTL2_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL2: EXTREN Position        */
#define EADC_AD0SPCTL2_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL2_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL2: EXTREN Mask            */

#define EADC_AD0SPCTL2_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL2: EXTFEN Position        */
#define EADC_AD0SPCTL2_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL2_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL2: EXTFEN Mask            */

#define EADC_AD0SPCTL3_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL3: CHSEL Position         */
#define EADC_AD0SPCTL3_CHSEL_Msk         (0xful << EADC_AD0SPCTL3_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL3: CHSEL Mask             */

#define EADC_AD0SPCTL3_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL3: TRGSEL Position        */
#define EADC_AD0SPCTL3_TRGSEL_Msk        (0xful << EADC_AD0SPCTL3_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL3: TRGSEL Mask            */

#define EADC_AD0SPCTL3_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD0SPCTL3: TRGDLYCNT Position     */
#define EADC_AD0SPCTL3_TRGDLYCNT_Msk     (0xfful << EADC_AD0SPCTL3_TRGDLYCNT_Pos)          /*!< EADC_T::AD0SPCTL3: TRGDLYCNT Mask         */

#define EADC_AD0SPCTL3_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD0SPCTL3: TRGDLYDIV Position     */
#define EADC_AD0SPCTL3_TRGDLYDIV_Msk     (0x3ul << EADC_AD0SPCTL3_TRGDLYDIV_Pos)           /*!< EADC_T::AD0SPCTL3: TRGDLYDIV Mask         */

#define EADC_AD0SPCTL3_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL3: EXTREN Position        */
#define EADC_AD0SPCTL3_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL3_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL3: EXTREN Mask            */

#define EADC_AD0SPCTL3_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL3: EXTFEN Position        */
#define EADC_AD0SPCTL3_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL3_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL3: EXTFEN Mask            */

#define EADC_AD0SPCTL4_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL4: CHSEL Position         */
#define EADC_AD0SPCTL4_CHSEL_Msk         (0xful << EADC_AD0SPCTL4_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL4: CHSEL Mask             */

#define EADC_AD0SPCTL4_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL4: TRGSEL Position        */
#define EADC_AD0SPCTL4_TRGSEL_Msk        (0x7ul << EADC_AD0SPCTL4_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL4: TRGSEL Mask            */

#define EADC_AD0SPCTL4_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL4: EXTREN Position        */
#define EADC_AD0SPCTL4_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL4_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL4: EXTREN Mask            */

#define EADC_AD0SPCTL4_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL4: EXTFEN Position        */
#define EADC_AD0SPCTL4_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL4_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL4: EXTFEN Mask            */

#define EADC_AD0SPCTL5_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL5: CHSEL Position         */
#define EADC_AD0SPCTL5_CHSEL_Msk         (0xful << EADC_AD0SPCTL5_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL5: CHSEL Mask             */

#define EADC_AD0SPCTL5_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL5: TRGSEL Position        */
#define EADC_AD0SPCTL5_TRGSEL_Msk        (0x7ul << EADC_AD0SPCTL5_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL5: TRGSEL Mask            */

#define EADC_AD0SPCTL5_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL5: EXTREN Position        */
#define EADC_AD0SPCTL5_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL5_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL5: EXTREN Mask            */

