RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define EADC_AD0SPCTL5_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL5: EXTFEN Position        */
#define EADC_AD0SPCTL5_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL5_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL5: EXTFEN Mask            */

#define EADC_AD0SPCTL6_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL6: CHSEL Position         */
#define EADC_AD0SPCTL6_CHSEL_Msk         (0xful << EADC_AD0SPCTL6_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL6: CHSEL Mask             */

#define EADC_AD0SPCTL6_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL6: TRGSEL Position        */
#define EADC_AD0SPCTL6_TRGSEL_Msk        (0x7ul << EADC_AD0SPCTL6_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL6: TRGSEL Mask            */

#define EADC_AD0SPCTL6_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL6: EXTREN Position        */
#define EADC_AD0SPCTL6_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL6_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL6: EXTREN Mask            */

#define EADC_AD0SPCTL6_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL6: EXTFEN Position        */
#define EADC_AD0SPCTL6_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL6_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL6: EXTFEN Mask            */

#define EADC_AD0SPCTL7_CHSEL_Pos         (0)                                               /*!< EADC_T::AD0SPCTL7: CHSEL Position         */
#define EADC_AD0SPCTL7_CHSEL_Msk         (0xful << EADC_AD0SPCTL7_CHSEL_Pos)               /*!< EADC_T::AD0SPCTL7: CHSEL Mask             */

#define EADC_AD0SPCTL7_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD0SPCTL7: TRGSEL Position        */
#define EADC_AD0SPCTL7_TRGSEL_Msk        (0x7ul << EADC_AD0SPCTL7_TRGSEL_Pos)              /*!< EADC_T::AD0SPCTL7: TRGSEL Mask            */

#define EADC_AD0SPCTL7_EXTREN_Pos        (20)                                              /*!< EADC_T::AD0SPCTL7: EXTREN Position        */
#define EADC_AD0SPCTL7_EXTREN_Msk        (0x1ul << EADC_AD0SPCTL7_EXTREN_Pos)              /*!< EADC_T::AD0SPCTL7: EXTREN Mask            */

#define EADC_AD0SPCTL7_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD0SPCTL7: EXTFEN Position        */
#define EADC_AD0SPCTL7_EXTFEN_Msk        (0x1ul << EADC_AD0SPCTL7_EXTFEN_Pos)              /*!< EADC_T::AD0SPCTL7: EXTFEN Mask            */

#define EADC_AD1SPCTL0_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL0: CHSEL Position         */
#define EADC_AD1SPCTL0_CHSEL_Msk         (0xful << EADC_AD1SPCTL0_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL0: CHSEL Mask             */

#define EADC_AD1SPCTL0_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL0: TRGSEL Position        */
#define EADC_AD1SPCTL0_TRGSEL_Msk        (0xful << EADC_AD1SPCTL0_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL0: TRGSEL Mask            */

#define EADC_AD1SPCTL0_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD1SPCTL0: TRGDLYCNT Position     */
#define EADC_AD1SPCTL0_TRGDLYCNT_Msk     (0xfful << EADC_AD1SPCTL0_TRGDLYCNT_Pos)          /*!< EADC_T::AD1SPCTL0: TRGDLYCNT Mask         */

#define EADC_AD1SPCTL0_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD1SPCTL0: TRGDLYDIV Position     */
#define EADC_AD1SPCTL0_TRGDLYDIV_Msk     (0x3ul << EADC_AD1SPCTL0_TRGDLYDIV_Pos)           /*!< EADC_T::AD1SPCTL0: TRGDLYDIV Mask         */

#define EADC_AD1SPCTL0_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL0: EXTREN Position        */
#define EADC_AD1SPCTL0_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL0_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL0: EXTREN Mask            */

#define EADC_AD1SPCTL0_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL0: EXTFEN Position        */
#define EADC_AD1SPCTL0_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL0_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL0: EXTFEN Mask            */

#define EADC_AD1SPCTL1_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL1: CHSEL Position         */
#define EADC_AD1SPCTL1_CHSEL_Msk         (0xful << EADC_AD1SPCTL1_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL1: CHSEL Mask             */

#define EADC_AD1SPCTL1_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL1: TRGSEL Position        */
#define EADC_AD1SPCTL1_TRGSEL_Msk        (0xful << EADC_AD1SPCTL1_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL1: TRGSEL Mask            */

#define EADC_AD1SPCTL1_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD1SPCTL1: TRGDLYCNT Position     */
#define EADC_AD1SPCTL1_TRGDLYCNT_Msk     (0xfful << EADC_AD1SPCTL1_TRGDLYCNT_Pos)          /*!< EADC_T::AD1SPCTL1: TRGDLYCNT Mask         */

#define EADC_AD1SPCTL1_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD1SPCTL1: TRGDLYDIV Position     */
#define EADC_AD1SPCTL1_TRGDLYDIV_Msk     (0x3ul << EADC_AD1SPCTL1_TRGDLYDIV_Pos)           /*!< EADC_T::AD1SPCTL1: TRGDLYDIV Mask         */

#define EADC_AD1SPCTL1_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL1: EXTREN Position        */
#define EADC_AD1SPCTL1_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL1_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL1: EXTREN Mask            */

#define EADC_AD1SPCTL1_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL1: EXTFEN Position        */
#define EADC_AD1SPCTL1_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL1_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL1: EXTFEN Mask            */

#define EADC_AD1SPCTL2_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL2: CHSEL Position         */
#define EADC_AD1SPCTL2_CHSEL_Msk         (0xful << EADC_AD1SPCTL2_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL2: CHSEL Mask             */

