RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define EADC_AD1SPCTL7_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL7: CHSEL Position         */
#define EADC_AD1SPCTL7_CHSEL_Msk         (0xful << EADC_AD1SPCTL7_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL7: CHSEL Mask             */

#define EADC_AD1SPCTL7_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL7: TRGSEL Position        */
#define EADC_AD1SPCTL7_TRGSEL_Msk        (0x7ul << EADC_AD1SPCTL7_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL7: TRGSEL Mask            */

#define EADC_AD1SPCTL7_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL7: EXTREN Position        */
#define EADC_AD1SPCTL7_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL7_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL7: EXTREN Mask            */

#define EADC_AD1SPCTL7_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL7: EXTFEN Position        */
#define EADC_AD1SPCTL7_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL7_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL7: EXTFEN Mask            */

#define EADC_SIMUSEL_SIMUSEL0_Pos        (0)                                               /*!< EADC_T::SIMUSEL: SIMUSEL0 Position        */
#define EADC_SIMUSEL_SIMUSEL0_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL0_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL0 Mask            */

#define EADC_SIMUSEL_SIMUSEL1_Pos        (1)                                               /*!< EADC_T::SIMUSEL: SIMUSEL1 Position        */
#define EADC_SIMUSEL_SIMUSEL1_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL1_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL1 Mask            */

#define EADC_SIMUSEL_SIMUSEL2_Pos        (2)                                               /*!< EADC_T::SIMUSEL: SIMUSEL2 Position        */
#define EADC_SIMUSEL_SIMUSEL2_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL2_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL2 Mask            */

#define EADC_SIMUSEL_SIMUSEL3_Pos        (3)                                               /*!< EADC_T::SIMUSEL: SIMUSEL3 Position        */
#define EADC_SIMUSEL_SIMUSEL3_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL3_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL3 Mask            */

#define EADC_SIMUSEL_SIMUSEL4_Pos        (4)                                               /*!< EADC_T::SIMUSEL: SIMUSEL4 Position        */
#define EADC_SIMUSEL_SIMUSEL4_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL4_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL4 Mask            */

#define EADC_SIMUSEL_SIMUSEL5_Pos        (5)                                               /*!< EADC_T::SIMUSEL: SIMUSEL5 Position        */
#define EADC_SIMUSEL_SIMUSEL5_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL5_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL5 Mask            */

#define EADC_SIMUSEL_SIMUSEL6_Pos        (6)                                               /*!< EADC_T::SIMUSEL: SIMUSEL6 Position        */
#define EADC_SIMUSEL_SIMUSEL6_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL6_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL6 Mask            */

#define EADC_SIMUSEL_SIMUSEL7_Pos        (7)                                               /*!< EADC_T::SIMUSEL: SIMUSEL7 Position        */
#define EADC_SIMUSEL_SIMUSEL7_Msk        (0x1ul << EADC_SIMUSEL_SIMUSEL7_Pos)              /*!< EADC_T::SIMUSEL: SIMUSEL7 Mask            */

#define EADC_CMP0_ADCMPEN_Pos            (0)                                               /*!< EADC_T::CMP: ADCMPEN Position            */
#define EADC_CMP0_ADCMPEN_Msk            (0x1ul << EADC_CMP0_ADCMPEN_Pos)                  /*!< EADC_T::CMP: ADCMPEN Mask                */

#define EADC_CMP0_ADCMPIE_Pos            (1)                                               /*!< EADC_T::CMP: ADCMPIE Position            */
#define EADC_CMP0_ADCMPIE_Msk            (0x1ul << EADC_CMP0_ADCMPIE_Pos)                  /*!< EADC_T::CMP: ADCMPIE Mask                */

#define EADC_CMP0_CMPCOND_Pos            (2)                                               /*!< EADC_T::CMP: CMPCOND Position            */
#define EADC_CMP0_CMPCOND_Msk            (0x1ul << EADC_CMP0_CMPCOND_Pos)                  /*!< EADC_T::CMP: CMPCOND Mask                */

#define EADC_CMP0_CMPSPL_Pos             (3)                                               /*!< EADC_T::CMP: CMPSPL Position             */
#define EADC_CMP0_CMPSPL_Msk             (0x7ul << EADC_CMP0_CMPSPL_Pos)                   /*!< EADC_T::CMP: CMPSPL Mask                 */

#define EADC_CMP0_CMPMCNT_Pos            (8)                                               /*!< EADC_T::CMP: CMPMCNT Position            */
#define EADC_CMP0_CMPMCNT_Msk            (0xful << EADC_CMP0_CMPMCNT_Pos)                  /*!< EADC_T::CMP: CMPMCNT Mask                */

#define EADC_CMP0_CMPDAT_Pos             (16)                                              /*!< EADC_T::CMP: CMPDAT Position             */
#define EADC_CMP0_CMPDAT_Msk             (0xffful << EADC_CMP0_CMPDAT_Pos)                 /*!< EADC_T::CMP: CMPDAT Mask                 */

#define EADC_CMP1_ADCMPEN_Pos            (0)                                               /*!< EADC_T::CMP: ADCMPEN Position            */
#define EADC_CMP1_ADCMPEN_Msk            (0x1ul << EADC_CMP1_ADCMPEN_Pos)                  /*!< EADC_T::CMP: ADCMPEN Mask                */

#define EADC_CMP1_ADCMPIE_Pos            (1)                                               /*!< EADC_T::CMP: ADCMPIE Position            */
#define EADC_CMP1_ADCMPIE_Msk            (0x1ul << EADC_CMP1_ADCMPIE_Pos)                  /*!< EADC_T::CMP: ADCMPIE Mask                */

#define EADC_CMP1_CMPCOND_Pos            (2)                                               /*!< EADC_T::CMP: CMPCOND Position            */
#define EADC_CMP1_CMPCOND_Msk            (0x1ul << EADC_CMP1_CMPCOND_Pos)                  /*!< EADC_T::CMP: CMPCOND Mask                */

#define EADC_CMP1_CMPSPL_Pos             (3)                                               /*!< EADC_T::CMP: CMPSPL Position             */
#define EADC_CMP1_CMPSPL_Msk             (0x7ul << EADC_CMP1_CMPSPL_Pos)                   /*!< EADC_T::CMP: CMPSPL Mask                 */

#define EADC_CMP1_CMPMCNT_Pos            (8)                                               /*!< EADC_T::CMP: CMPMCNT Position            */
#define EADC_CMP1_CMPMCNT_Msk            (0xful << EADC_CMP1_CMPMCNT_Pos)                  /*!< EADC_T::CMP: CMPMCNT Mask                */

#define EADC_CMP1_CMPDAT_Pos             (16)                                              /*!< EADC_T::CMP: CMPDAT Position             */
#define EADC_CMP1_CMPDAT_Msk             (0xffful << EADC_CMP1_CMPDAT_Pos)                 /*!< EADC_T::CMP: CMPDAT Mask                 */

#define EADC_STATUS0_VALID_Pos           (0)                                               /*!< EADC_T::STATUS0: VALID Position           */
#define EADC_STATUS0_VALID_Msk           (0xfffful << EADC_STATUS0_VALID_Pos)              /*!< EADC_T::STATUS0: VALID Mask               */

