RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define EADC_AD0TRGEN2_EPWM14CEN_Pos     (23)                                              /*!< EADC_T::AD0TRGEN2: EPWM14CEN Position     */
#define EADC_AD0TRGEN2_EPWM14CEN_Msk     (0x1ul << EADC_AD0TRGEN2_EPWM14CEN_Pos)           /*!< EADC_T::AD0TRGEN2: EPWM14CEN Mask         */

#define EADC_AD0TRGEN2_PWM00REN_Pos      (24)                                              /*!< EADC_T::AD0TRGEN2: PWM00REN Position      */
#define EADC_AD0TRGEN2_PWM00REN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM00REN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM00REN Mask          */

#define EADC_AD0TRGEN2_PWM00FEN_Pos      (25)                                              /*!< EADC_T::AD0TRGEN2: PWM00FEN Position      */
#define EADC_AD0TRGEN2_PWM00FEN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM00FEN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM00FEN Mask          */

#define EADC_AD0TRGEN2_PWM00PEN_Pos      (26)                                              /*!< EADC_T::AD0TRGEN2: PWM00PEN Position      */
#define EADC_AD0TRGEN2_PWM00PEN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM00PEN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM00PEN Mask          */

#define EADC_AD0TRGEN2_PWM00CEN_Pos      (27)                                              /*!< EADC_T::AD0TRGEN2: PWM00CEN Position      */
#define EADC_AD0TRGEN2_PWM00CEN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM00CEN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM00CEN Mask          */

#define EADC_AD0TRGEN2_PWM01REN_Pos      (28)                                              /*!< EADC_T::AD0TRGEN2: PWM01REN Position      */
#define EADC_AD0TRGEN2_PWM01REN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM01REN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM01REN Mask          */

#define EADC_AD0TRGEN2_PWM01FEN_Pos      (29)                                              /*!< EADC_T::AD0TRGEN2: PWM01FEN Position      */
#define EADC_AD0TRGEN2_PWM01FEN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM01FEN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM01FEN Mask          */

#define EADC_AD0TRGEN2_PWM01PEN_Pos      (30)                                              /*!< EADC_T::AD0TRGEN2: PWM01PEN Position      */
#define EADC_AD0TRGEN2_PWM01PEN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM01PEN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM01PEN Mask          */

#define EADC_AD0TRGEN2_PWM01CEN_Pos      (31)                                              /*!< EADC_T::AD0TRGEN2: PWM01CEN Position      */
#define EADC_AD0TRGEN2_PWM01CEN_Msk      (0x1ul << EADC_AD0TRGEN2_PWM01CEN_Pos)            /*!< EADC_T::AD0TRGEN2: PWM01CEN Mask          */

#define EADC_AD0TRGEN3_EPWM00REN_Pos     (0)                                               /*!< EADC_T::AD0TRGEN3: EPWM00REN Position     */
#define EADC_AD0TRGEN3_EPWM00REN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM00REN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM00REN Mask         */

#define EADC_AD0TRGEN3_EPWM00FEN_Pos     (1)                                               /*!< EADC_T::AD0TRGEN3: EPWM00FEN Position     */
#define EADC_AD0TRGEN3_EPWM00FEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM00FEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM00FEN Mask         */

#define EADC_AD0TRGEN3_EPWM00PEN_Pos     (2)                                               /*!< EADC_T::AD0TRGEN3: EPWM00PEN Position     */
#define EADC_AD0TRGEN3_EPWM00PEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM00PEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM00PEN Mask         */

#define EADC_AD0TRGEN3_EPWM00CEN_Pos     (3)                                               /*!< EADC_T::AD0TRGEN3: EPWM00CEN Position     */
#define EADC_AD0TRGEN3_EPWM00CEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM00CEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM00CEN Mask         */

#define EADC_AD0TRGEN3_EPWM02REN_Pos     (4)                                               /*!< EADC_T::AD0TRGEN3: EPWM02REN Position     */
#define EADC_AD0TRGEN3_EPWM02REN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM02REN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM02REN Mask         */

#define EADC_AD0TRGEN3_EPWM02FEN_Pos     (5)                                               /*!< EADC_T::AD0TRGEN3: EPWM02FEN Position     */
#define EADC_AD0TRGEN3_EPWM02FEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM02FEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM02FEN Mask         */

#define EADC_AD0TRGEN3_EPWM02PEN_Pos     (6)                                               /*!< EADC_T::AD0TRGEN3: EPWM02PEN Position     */
#define EADC_AD0TRGEN3_EPWM02PEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM02PEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM02PEN Mask         */

#define EADC_AD0TRGEN3_EPWM02CEN_Pos     (7)                                               /*!< EADC_T::AD0TRGEN3: EPWM02CEN Position     */
#define EADC_AD0TRGEN3_EPWM02CEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM02CEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM02CEN Mask         */

#define EADC_AD0TRGEN3_EPWM04REN_Pos     (8)                                               /*!< EADC_T::AD0TRGEN3: EPWM04REN Position     */
#define EADC_AD0TRGEN3_EPWM04REN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM04REN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM04REN Mask         */

#define EADC_AD0TRGEN3_EPWM04FEN_Pos     (9)                                               /*!< EADC_T::AD0TRGEN3: EPWM04FEN Position     */
#define EADC_AD0TRGEN3_EPWM04FEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM04FEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM04FEN Mask         */

#define EADC_AD0TRGEN3_EPWM04PEN_Pos     (10)                                              /*!< EADC_T::AD0TRGEN3: EPWM04PEN Position     */
#define EADC_AD0TRGEN3_EPWM04PEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM04PEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM04PEN Mask         */

#define EADC_AD0TRGEN3_EPWM04CEN_Pos     (11)                                              /*!< EADC_T::AD0TRGEN3: EPWM04CEN Position     */
#define EADC_AD0TRGEN3_EPWM04CEN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM04CEN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM04CEN Mask         */

#define EADC_AD0TRGEN3_EPWM10REN_Pos     (12)                                              /*!< EADC_T::AD0TRGEN3: EPWM10REN Position     */
#define EADC_AD0TRGEN3_EPWM10REN_Msk     (0x1ul << EADC_AD0TRGEN3_EPWM10REN_Pos)           /*!< EADC_T::AD0TRGEN3: EPWM10REN Mask         */

