RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
    /**
     * Px_DBEN
     * ===================================================================================================
     * Offset: 0x14  Px De-Bounce Enable Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DBEN0     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[1]     |DBEN1     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[2]     |DBEN2     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[3]     |DBEN3     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[4]     |DBEN4     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[5]     |DBEN5     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[6]     |DBEN6     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[7]     |DBEN7     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[8]     |DBEN8     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[9]     |DBEN9     |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[10]    |DBEN10    |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[11]    |DBEN11    |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[12]    |DBEN12    |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[13]    |DBEN13    |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[14]    |DBEN14    |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
     * |[15]    |DBEN15    |Port N Bit M Input De-Bounce Enable
     * |        |          |DBEN[m] is used to enable the de-bounce function for each corresponding bit.
     * |        |          |DBEN[m] is valid for "edge-triggered" interrupt only and is ignored for "level triggered" interrupt.
     * |        |          |If the input signal pulse width can't be sampled by continuous two de-bounce sample cycle The input signal transition is seen as the signal bounce and will not trigger the interrupt.
     * |        |          |The de-bounce clock is controlled by GPIO_DBCTL register.
     * |        |          |0 = Port n bit m input de-bounce Disabled.
     * |        |          |1 = Port n bit m input de-bounce Enabled.
    */
    __IO uint32_t DBEN;

