RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
    /**
     * Px_SMTEN
     * ===================================================================================================
     * Offset: 0x24  Px Input Schmitt Trigger Enable
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SMTEN0    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[1]     |SMTEN1    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[2]     |SMTEN2    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[3]     |SMTEN3    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[4]     |SMTEN4    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[5]     |SMTEN5    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[6]     |SMTEN6    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[7]     |SMTEN7    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[8]     |SMTEN8    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[9]     |SMTEN9    |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[10]    |SMTEN10   |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[11]    |SMTEN11   |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[12]    |SMTEN12   |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[13]    |SMTEN13   |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[14]    |SMTEN14   |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
     * |[15]    |SMTEN15   |0 = P I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P I/O input Schmitt Trigger function Enabled.
    */
    __IO uint32_t SMTEN;

    /**
     * Px_SLEWCTL
     * ===================================================================================================
     * Offset: 0x28  Px High Slew Rate Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HSREN0    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[1]     |HSREN1    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[2]     |HSREN2    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[3]     |HSREN3    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[4]     |HSREN4    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[5]     |HSREN5    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[6]     |HSREN6    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[7]     |HSREN7    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[8]     |HSREN8    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[9]     |HSREN9    |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[10]    |HSREN10   |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[11]    |HSREN11   |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[12]    |HSREN12   |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[13]    |HSREN13   |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[14]    |HSREN14   |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
     * |[15]    |HSREN15   |0 = P I/O output with basic slew rate.
     * |        |          |1 = P I/O output with higher slew rate.
    */
    __IO uint32_t SLEWCTL;

} GPIO_T;


typedef struct {

    /**
     * GPIO_DBCTL
     * ===================================================================================================
     * Offset: 0x000  Interrupt De-bounce Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |DBCLKSEL  |De-Bounce Sampling Cycle Selection
     * |        |          |0000 = Sample interrupt input once per 1 clocks.
     * |        |          |0001 = Sample interrupt input once per 2 clocks.
     * |        |          |0010 = Sample interrupt input once per 4 clocks.
     * |        |          |0011 = Sample interrupt input once per 8 clocks.
     * |        |          |0100 = Sample interrupt input once per 16 clocks.
     * |        |          |0101 = Sample interrupt input once per 32 clocks.
     * |        |          |0110 = Sample interrupt input once per 64 clocks.
     * |        |          |0111 = Sample interrupt input once per 128 clocks.
     * |        |          |1000 = Sample interrupt input once per 256 clocks.
     * |        |          |1001 = Sample interrupt input once per 2*256 clocks.
     * |        |          |1010 = Sample interrupt input once per 4*256 clocks.
     * |        |          |1011 = Sample interrupt input once per 8*256 clocks.
     * |        |          |1100 = Sample interrupt input once per 16*256 clocks.
     * |        |          |1101 = Sample interrupt input once per 32*256 clocks.
     * |        |          |1110 = Sample interrupt input once per 64*256 clocks.
     * |        |          |1111 = Sample interrupt input once per 128*256 clocks.
     * |[4]     |DBCLKSRC  |De-Bounce Counter Clock Source Selection
     * |        |          |0 = De-bounce counter clock source is the HCLK.
     * |        |          |1 = De-bounce counter clock source is the internal 10 kHz clock.
     * |[5]     |ICLKON    |Interrupt Clock On Mode
     * |        |          |Setting this bit to 0 will disable the interrupt generate circuit clock if the pin[n] interrupt is disabled.
     * |        |          |0 = Disable the clock if the all port interrupts are disabled.
     * |        |          |1 = Interrupt generated circuit clock always Enabled.
    */
    __IO uint32_t DBCTL;

} GPIO_DB_T;

/**
    @addtogroup GPIO_CONST GPIO Bit Field Definition
    Constant Definitions for GPIO Controller
@{ */

#define GPIO_MODE_MODE0_Pos              (0)                                               /*!< GPIO_T::MODE: MODE0 Position              */
#define GPIO_MODE_MODE0_Msk              (0x3ul << GPIO_MODE_MODE0_Pos)                    /*!< GPIO_T::MODE: MODE0 Mask                  */

#define GPIO_MODE_MODE1_Pos              (2)                                               /*!< GPIO_T::MODE: MODE1 Position              */
#define GPIO_MODE_MODE1_Msk              (0x3ul << GPIO_MODE_MODE1_Pos)                    /*!< GPIO_T::MODE: MODE1 Mask                  */

#define GPIO_MODE_MODE2_Pos              (4)                                               /*!< GPIO_T::MODE: MODE2 Position              */
#define GPIO_MODE_MODE2_Msk              (0x3ul << GPIO_MODE_MODE2_Pos)                    /*!< GPIO_T::MODE: MODE2 Mask                  */

#define GPIO_MODE_MODE3_Pos              (6)                                               /*!< GPIO_T::MODE: MODE3 Position              */
#define GPIO_MODE_MODE3_Msk              (0x3ul << GPIO_MODE_MODE3_Pos)                    /*!< GPIO_T::MODE: MODE3 Mask                  */

#define GPIO_MODE_MODE4_Pos              (8)                                               /*!< GPIO_T::MODE: MODE4 Position              */
#define GPIO_MODE_MODE4_Msk              (0x3ul << GPIO_MODE_MODE4_Pos)                    /*!< GPIO_T::MODE: MODE4 Mask                  */

#define GPIO_MODE_MODE5_Pos              (10)                                              /*!< GPIO_T::MODE: MODE5 Position              */
#define GPIO_MODE_MODE5_Msk              (0x3ul << GPIO_MODE_MODE5_Pos)                    /*!< GPIO_T::MODE: MODE5 Mask                  */

#define GPIO_MODE_MODE6_Pos              (12)                                              /*!< GPIO_T::MODE: MODE6 Position              */
#define GPIO_MODE_MODE6_Msk              (0x3ul << GPIO_MODE_MODE6_Pos)                    /*!< GPIO_T::MODE: MODE6 Mask                  */

#define GPIO_MODE_MODE7_Pos              (14)                                              /*!< GPIO_T::MODE: MODE7 Position              */
#define GPIO_MODE_MODE7_Msk              (0x3ul << GPIO_MODE_MODE7_Pos)                    /*!< GPIO_T::MODE: MODE7 Mask                  */

