RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define OTG_INTSTS_PDEVIF_Pos            (6)                                               /*!< OTG_T::INTSTS: PDEVIF Position            */
#define OTG_INTSTS_PDEVIF_Msk            (0x1ul << OTG_INTSTS_PDEVIF_Pos)                  /*!< OTG_T::INTSTS: PDEVIF Mask                */

#define OTG_INTSTS_HOSTIF_Pos            (7)                                               /*!< OTG_T::INTSTS: HOSTIF Position            */
#define OTG_INTSTS_HOSTIF_Msk            (0x1ul << OTG_INTSTS_HOSTIF_Pos)                  /*!< OTG_T::INTSTS: HOSTIF Mask                */

#define OTG_INTSTS_BVLDCHGIF_Pos         (8)                                               /*!< OTG_T::INTSTS: BVLDCHGIF Position         */
#define OTG_INTSTS_BVLDCHGIF_Msk         (0x1ul << OTG_INTSTS_BVLDCHGIF_Pos)               /*!< OTG_T::INTSTS: BVLDCHGIF Mask             */

#define OTG_INTSTS_AVLDCHGIF_Pos         (9)                                               /*!< OTG_T::INTSTS: AVLDCHGIF Position         */
#define OTG_INTSTS_AVLDCHGIF_Msk         (0x1ul << OTG_INTSTS_AVLDCHGIF_Pos)               /*!< OTG_T::INTSTS: AVLDCHGIF Mask             */

#define OTG_INTSTS_VBCHGIF_Pos           (10)                                              /*!< OTG_T::INTSTS: VBCHGIF Position           */
#define OTG_INTSTS_VBCHGIF_Msk           (0x1ul << OTG_INTSTS_VBCHGIF_Pos)                 /*!< OTG_T::INTSTS: VBCHGIF Mask               */

#define OTG_INTSTS_SECHGIF_Pos           (11)                                              /*!< OTG_T::INTSTS: SECHGIF Position           */
#define OTG_INTSTS_SECHGIF_Msk           (0x1ul << OTG_INTSTS_SECHGIF_Pos)                 /*!< OTG_T::INTSTS: SECHGIF Mask               */

#define OTG_INTSTS_SRPDETIF_Pos          (13)                                              /*!< OTG_T::INTSTS: SRPDETIF Position          */
#define OTG_INTSTS_SRPDETIF_Msk          (0x1ul << OTG_INTSTS_SRPDETIF_Pos)                /*!< OTG_T::INTSTS: SRPDETIF Mask              */

#define OTG_STATUS_OVERCUR_Pos           (0)                                               /*!< OTG_T::STATUS: OVERCUR Position           */
#define OTG_STATUS_OVERCUR_Msk           (0x1ul << OTG_STATUS_OVERCUR_Pos)                 /*!< OTG_T::STATUS: OVERCUR Mask               */

#define OTG_STATUS_IDSTS_Pos             (1)                                               /*!< OTG_T::STATUS: IDSTS Position             */
#define OTG_STATUS_IDSTS_Msk             (0x1ul << OTG_STATUS_IDSTS_Pos)                   /*!< OTG_T::STATUS: IDSTS Mask                 */

#define OTG_STATUS_SESSEND_Pos           (2)                                               /*!< OTG_T::STATUS: SESSEND Position           */
#define OTG_STATUS_SESSEND_Msk           (0x1ul << OTG_STATUS_SESSEND_Pos)                 /*!< OTG_T::STATUS: SESSEND Mask               */

#define OTG_STATUS_BVLD_Pos              (3)                                               /*!< OTG_T::STATUS: BVLD Position            */
#define OTG_STATUS_BVLD_Msk              (0x1ul << OTG_STATUS_BVLD_Pos)                    /*!< OTG_T::STATUS: BVLD Mask                */

#define OTG_STATUS_AVLD_Pos              (4)                                               /*!< OTG_T::STATUS: AVLD Position              */
#define OTG_STATUS_AVLD_Msk              (0x1ul << OTG_STATUS_AVLD_Pos)                    /*!< OTG_T::STATUS: AVLD Mask                  */

#define OTG_STATUS_VBUSVLD_Pos           (5)                                               /*!< OTG_T::STATUS: VBUSVLD Position           */
#define OTG_STATUS_VBUSVLD_Msk           (0x1ul << OTG_STATUS_VBUSVLD_Pos)                 /*!< OTG_T::STATUS: VBUSVLD Mask               */

/**@}*/ /* OTG_CONST */
/**@}*/ /* end of OTG register group */


/*---------------------- Peripheral Direct Memory Access Controller -------------------------*/
/**
    @addtogroup PDMA Peripheral Direct Memory Access Controller(PDMA)
    Memory Mapped Structure for PDMA Controller
@{ */

typedef struct {

    /**
     * DSCTx_CTL
     * ===================================================================================================
     * Offset: 0x00  Descriptor Table Control Register of PDMA Channel x
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |OPMODE    |PDMA Operation Mode Selection
     * |        |          |00 = Stop Mode.
     * |        |          |Channel is stopped or this table is complete, when PDMA finish channel table task, OPMODE will be cleared to stop mode automatically.
     * |        |          |01 = Basic Mode.
     * |        |          |The descriptor table only has one task.
     * |        |          |When this task is finished, the PDMA_INTSTS[x] will be asserted.
     * |        |          |10 = Scatter-Gather Mode.
     * |        |          |When operating in this mode, user must give the next descriptor table address in EMBTA_NTAAR register; PDMA will ignore this task, and then load the next task to execute.
     * |        |          |Note: Before filling transfer task in the descriptor table, user must check if the descriptor table is complete.
     * |[2]     |TXTYPE    |Request Type
     * |        |          |0 = Burst request type.
     * |        |          |1 = Single request type.
     * |[4:6]   |BURSIZE   |Burst Size
     * |        |          |This field is used for peripheral to determine the burst size or used for determine the re-arbitration size.
     * |        |          |But if in Single Request Type, this field is not useful and only 1 transfer item been transmitted for each transfer.
     * |        |          |000 = 128 transfers.
     * |        |          |001 = 64 transfers.
     * |        |          |010 = 32 transfers.
     * |        |          |011 = 16 transfers.
     * |        |          |100 = 8 transfers.
     * |        |          |101 = 4 transfers.
     * |        |          |110 = 2 transfers.
     * |        |          |111 = 1 transfers.
     * |[7]     |TBINTDIS  |Table Interrupt Disable Control
     * |        |          |This field can be used to decide whether to enable table interrupt or not.
     * |        |          |When with transfer done flag, this bit is only used for scatter-gather mode.
     * |        |          |If the TBINTDIS bit is enabled when PDMA finishes this task, there will no any interrupt generated.
     * |        |          |However, with the table empty flag, this bit is also useful.
     * |        |          |If it is set to '1', the TEMPTYF will not be set when this situation has happened.
     * |        |          |0 = Table interrupt Enabled.
     * |        |          |1 = Table interrupt Disabled.
     * |[8:9]   |SAINC     |Source Address Increment
     * |        |          |This field is used to set the source address increment size
     * |        |          |11 = No Increment (Fixed Address.).
     * |        |          |Other = Increment and size is depended on TXWIDTH selection.
     * |[10:11] |DAINC     |Destination Address Increment
     * |        |          |This field is used to set the destination address increment size
     * |        |          |11 = No Increment (Fixed Address.).
     * |        |          |Other = Increment and size is depended on TXWIDTH selection.
     * |[12:13] |TXWIDTH   |Transfer Width Selection
     * |        |          |This field is used for transfer width.
     * |        |          |00 = 8 bits for every transfer item.
     * |        |          |01 = 16 bits for every transfer item.
     * |        |          |10 = 32 bits for every transfer item.
     * |        |          |11 = Reserved.
     * |        |          |Note: The PDMA transfer source address (EMBTA_ENDSAR) and PDMA transfer destination address (EMBTA_ENDDAR) should be alignment under the TXWIDTH selection
     * |[16:29] |TXCNT     |Transfer Count
     * |        |          |The TXCNT represents the required number of PDMA transfer, the real transfer count is (TXCNT + 1); The maximum transfer count is 16384 , every transfer may be byte, half-word or word that is dependent on TXWIDTH field.
     * |        |          |Note: When PDMA finish each transfer item, this field will be decrease imminently
    */
    __IO uint32_t CTL;

    /**
     * DSCTx_ENDSA
     * ===================================================================================================
     * Offset: 0x04  End Source Address Register of PDMA Channel x
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ENDSA     |PDMA Transfer Ending Source Address Bits
     * |        |          |This field indicates a 32-bit ending source address of PDMA.
     * |        |          |Note: If the source start address is 0x2000_0000, the transfer count is 0x100 and the source address increment is word, this field must be filled 0x2000_0400.
     * |        |          |The equation is "0x2000_0400 = 0x2000_0000 + 0x100*4(word)".
    */
    __IO uint32_t ENDSA;

    /**
     * DSCTx_ENDDA
     * ===================================================================================================
     * Offset: 0x08  End Destination Address Register of PDMA Channel x
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ENDDA     |PDMA Transfer Ending Destination Address Bits
     * |        |          |This field indicates a 32-bit ending destination address of PDMA.
     * |        |          |Note: If the destination start address is 0x2000_0000, the transfer count is 0x100 and the destination address increment is word, this field must be filled 0x2000_0400.
     * |        |          |The equation is "0x2000_0400 = 0x2000_0000 + 0x100*4(word)".
    */
    __IO uint32_t ENDDA;

    /**
     * DSCTx_NEXT
     * ===================================================================================================
     * Offset: 0x0C  Scatter-Gather Descriptor Table Offset Address of PDMA Channel x
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:15]  |NEXT      |PDMA Next Description Table Offset Address Bits
     * |        |          |This field indicates the offset of next descriptor table address in system memory.
     * |        |          |Note1: The next descriptor table address must be word boundary.
     * |        |          |Note2: The system memory based address is 0x2000_0000 (PDMA_ETADDR), if the next descriptor table is 0x2000_0100, that this field must fill 0x0100.
     * |        |          |Note3: Before filled transfer task in the description table, user must check if the descriptor table is complete.
    */
    __IO uint32_t NEXT;

