RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
typedef struct {


    /**
     * CLKPSC
     * ===================================================================================================
     * Offset: 0x00  PWM Clock Prescale Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |CLKPSC01  |PWM Counter Base-Clock Prescale For PWM Pair Of Channel 0 And Channel 1
     * |        |          |The base-clock of PWM counter is decided by clock pre-scalar and clock divider.
     * |        |          |Each PWM pair share one PWM counter base-clock prescaler.
     * |        |          |The base-clock of PWM counter is divided by (CLKPSC01 + 1).
     * |        |          |If the value of CLKPSC01 is zero, the base-clock prescaler will stop output clock and corresponding PWM counter will also stop.
     * |[8:15]  |CLKPSC23  |PWM Counter Base-Clock Prescale For PWM Pair Of Channel 2 And Channel 3
     * |        |          |The base-clock of PWM counter is decided by clock pre-scalar and clock divider.
     * |        |          |Each PWM pair share one PWM counter base-clock prescaler.
     * |        |          |The base-clock of PWM counter is divided by (CLKPSC23 + 1).
     * |        |          |If the value of CLKPSC23 is zero, the base-clock prescaler will stop output clock and corresponding PWM counter will also stop.
     * |[16:23] |CLKPSC45  |PWM Counter Base-Clock Prescale For PWM Pair Of Channel 4 And Channel 5
     * |        |          |The base-clock of PWM counter is decided by clock pre-scalar and clock divider.
     * |        |          |Each PWM pair share one PWM counter base-clock prescaler.
     * |        |          |The base-clock of PWM counter is divided by (CLKPSC45 + 1).
     * |        |          |If the value of CLKPSC45 is zero, the base-clock prescaler will stop output clock and corresponding PWM counter will also stop.
    */
    __IO uint32_t CLKPSC;

    /**
     * CLKDIV
     * ===================================================================================================
     * Offset: 0x04  PWM Clock Divide Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:2]   |CLKDIV0   |PWM Counter Base-Clock Divide For PWMx_CH0
     * |        |          |(Table is the same as CLKDIV5)
     * |[4:6]   |CLKDIV1   |PWM Counter Base-Clock Divide For PWMx_CH1
     * |        |          |(Table is the same as CLKDIV5)
     * |[8:10]  |CLKDIV2   |PWM Counter Base-Clock Divide For PWMx_CH2
     * |        |          |(Table is the same as CLKDIV5)
     * |[12:14] |CLKDIV3   |PWM Counter Base-Clock Divide For PWMx_CH3
     * |        |          |(Table is the same as CLKDIV5)
     * |[16:18] |CLKDIV4   |PWM Counter Base-Clock Divide For PWMx_CH4
     * |        |          |(Table is the same as CLKDIV5)
     * |[20:22] |CLKDIV5   |PWM Counter Base-Clock Divide For PWMx_CH5
     * |        |          |The base-clock of PWM counter is decided by clock pre-scalar and clock divider.
     * |        |          |Each PWM counter has independent clock divider control register and the divided value is listed in the table below:.
     * |        |          |000 = 2.
     * |        |          |001 = 4.
     * |        |          |010 = 8.
     * |        |          |011 = 16.
     * |        |          |100 = 1.
    */
    __IO uint32_t CLKDIV;

    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x08  PWM Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |CMPINV    |PWM Comparator Output Inverter Enable Control
     * |        |          |When CMPINV is set to high, the PWM comparator output signals will be inversed,
     * |        |          |0 = Comparator output inverter Disabled.
     * |        |          |1 = Comparator output inverter Enabled.
     * |        |          |Note: Each bit control corresponding PWM channel
     * |[6]     |OUTMODE   |PWM Output Mode
     * |        |          |The register controls the output mode of PWM
     * |        |          |0 = PWM output at independent mode.
     * |        |          |1 = PWM output at complementary mode.
     * |[7]     |GROUPEN   |Group Mode Enable Control
     * |        |          |0 = The signals timing of each PWM channel are independent.
     * |        |          |1 = Unify the signals timing of PWM0, PWM2 and PWM4 in the same phase which is controlled by PWM0 and unify the signals timing of PWM1, PWM3 and PWM5 in the same phase which is controlled by PWM1.
     * |[8:13]  |PINV      |PWM Output Polar Inverse Enable Control
     * |        |          |The register controls polarity state of PWM output
     * |        |          |0 = PWM output polar inverse Disabled.
     * |        |          |1 = PWM output polar inverse Enabled.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[15]    |SYNCEN    |Synchronous Mode Enable Control
     * |        |          |0 = The signals timing of each PWM channel are independent.
     * |        |          |1 = Unify the signals timing of PWM0 and PWM1 in the same phase which is controlled by PWM0 and so as another two PWM pair.
     * |        |          |Note: If Group and Synchronous mode are enabled simultaneously, the Synchronous mode will be inactive.
     * |[16:21] |CNTMODE   |PWM Counter Operation Mode
     * |        |          |0 = PWM counter working as One-shot mode.
     * |        |          |1 = PWM counter working as Auto-reload mode.
     * |        |          |Note: Each bit control corresponding PWM channel
     * |        |          |Note: If there is a transition at this bit, it will cause PWM_PERIODn and PWM_CMPDATn be cleared.
     * |[24:29] |CNTTYPE   |PWM Counter Operation Aligned Type
     * |        |          |0 = PWM counter operating as Edge-aligned type.
     * |        |          |1 = PWM counter operating as Center-aligned type.
     * |        |          |Note: Each bit control corresponding PWM channel
     * |[31]    |DBGTRIOFF |ICE Debug Mode Acknowledge Disable Control (Write Protect)
     * |        |          |0 = ICE debug mode acknowledgement effects PWM output.
     * |        |          |PWM pin will be forced as tri-state while ICE debug mode acknowledged.
     * |        |          |1 = ICE debug mode acknowledgement disabled.
     * |        |          |PWM pin will keep output no matter ICE debug mode acknowledged or not.
    */
    __IO uint32_t CTL;

    /**
     * CNTEN
     * ===================================================================================================
     * Offset: 0x0C  PWM Counter Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |CNTEN     |PWM Counter Enable Control
     * |        |          |0 = PWM Counter Stop Running.
     * |        |          |1 = PWM Counter Start Running.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t CNTEN;

    /**
     * PERIOD
     * ===================================================================================================
     * Offset: 0x10 ~ 0x24 PWM Counter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |PERIOD    |PWM Period Register
     * |        |          |PERIOD determines the PWM period.
     * |        |          |PWM frequency = PWMxy_CLK/[(prescale+1)*(clock divider)*(PERIOD+1)]; where xy, could be 01, 23 or 45, depends on selected PWM channel.
     * |        |          |For Edge-aligned mode:
     * |        |          |l Duty ratio = (CMP+1)/(PERIOD+1).
     * |        |          |l CMP >= PERIOD: PWM output is always high.
     * |        |          |l CMP < PERIOD: PWM low width = (PERIOD-CMP) unit; PWM high width = (CMP+1) unit.
     * |        |          |l CMP = 0: PWM low width = (PERIOD) unit; PWM high width = 1 unit.
     * |        |          |For Center-aligned mode:
     * |        |          |l Duty ratio = [(2 x CMP) + 1]/[2 x (PERIOD+1)].
     * |        |          |l CMP > PERIOD: PWM output is always high.
     * |        |          |l CMP <= PERIOD: PWM low width = 2 x (PERIOD-CMP) + 1 unit; PWM high width = (2 x CMP) + 1 unit.
     * |        |          |l CMP = 0: PWM low width = 2 x PERIOD + 1 unit; PWM high width = 1 unit.
     * |        |          |(Unit = one PWM clock cycle).
     * |        |          |Note1: Any write to PERIOD will take effect in next PWM cycle.
     * |        |          |Note2: When PWM operating at center-aligned type, PERIOD value should be set between 0x0000 to 0xFFFE.
     * |        |          |If PERIOD equal to 0xFFFF, the PWM will work unpredictable.
     * |        |          |Note3: When PERIOD value is set to 0, PWM output is always high.
    */
    __IO uint32_t PERIOD[6];

    /**
     * CMPDAT
     * ===================================================================================================
     * Offset: 0x28 ~0x3C PWM Comparator Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |CMP       |PWM Duty Register
     * |        |          |CMP determines the PWM duty.
     * |        |          |PWM frequency = PWMxy_CLK/[(prescale+1)*(clock divider)*(PERIOD+1)]; where xy, could be 01, 23 or, 45, depends on selected PWM channel.
     * |        |          |For Edge-aligned mode:
     * |        |          |l Duty ratio = (CMP+1)/(PERIOD+1).
     * |        |          |l CMP >= PERIOD: PWM output is always high.
     * |        |          |l CMP < PERIOD: PWM low width = (PERIOD-CMP) unit; PWM high width = (CMP+1) unit.
     * |        |          |l CMP = 0: PWM low width = (PERIOD) unit; PWM high width = 1 unit.
     * |        |          |For Center-aligned mode:
     * |        |          |l Duty ratio = [(2 x CMP) + 1]/[2 x (PERIOD+1)].
     * |        |          |l CMP > PERIOD: PWM output is always high.
     * |        |          |l CMP <= PERIOD: PWM low width = 2 x (PERIOD-CMP) + 1 unit; PWM high width = (2 x CMP) + 1 unit.
     * |        |          |l CMP = 0: PWM low width = 2 x PERIOD + 1 unit; PWM high width = 1 unit.
     * |        |          |(Unit = one PWM clock cycle).
     * |        |          |Note: Any write to CMP will take effect in next PWM cycle.
    */
    __IO uint32_t CMPDAT[6];

    /**
     * CNT
     * ===================================================================================================
     * Offset: 0x40 ~ 0x54 PWM Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |CNT       |PWM Data Register
     * |        |          |User can monitor CNT to know the current value in 16-bit down counter.
     * |        |          |Note: It is recommended that read this register when PWM engine clock is source from system clock, otherwise a transition value of PWM counter may be read.
    */
    __I  uint32_t CNT[6];

    /**
     * MSKEN
     * ===================================================================================================
     * Offset: 0x58  PWM Mask Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |MSKEN     |PWM Mask Enable Control
     * |        |          |The PWM output signal will be masked when this bit is enabled.
     * |        |          |The corresponding PWMn channel will be output with MSKDAT data.
     * |        |          |0 = PWM output signal is non-masked.
     * |        |          |1 = PWM output signal is masked and output with MSKDAT data.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t MSKEN;

    /**
     * MSK
     * ===================================================================================================
     * Offset: 0x5C  PWM Mask Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |MSKDAT    |PWM Mask Data Bit:
     * |        |          |This data bit control the state of PWMn output pin, if corresponding mask function is enabled.
     * |        |          |0 = Output logic low to PWMn.
     * |        |          |1 = Output logic high to PWMn.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t MSK;

    /**
     * DTCTL
     * ===================================================================================================
     * Offset: 0x60  PWM Dead-zone Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |DTCNT01   |Dead-Zone Interval For PWM Pair Of Channel 0 And Channel 1
     * |        |          |These 8-bit determine the Dead-zone length.
     * |        |          |The unit time of Dead-zone length is received from corresponding PWM_CLKDIV.
     * |[8:15]  |DTCNT23   |Dead-Zone Interval For PWM Pair Of Channel 2 And Channel 3
     * |        |          |These 8-bit determine the Dead-zone length.
     * |        |          |The unit time of Dead-zone length is received from corresponding PWM_CLKDIV.
     * |[16:23] |DTCNT45   |Dead-Zone Interval For PWM Pair Of Channel 4 And Channel 5
     * |        |          |These 8-bit determine the Dead-zone length.
     * |        |          |The unit time of Dead-zone length is received from corresponding PWM_CLKDIV.
     * |[24:25] |DTDIV     |Dead-Zone Generator Divider
     * |        |          |00 = Dead-zone clock equal to PWM base clock divide 1.
     * |        |          |01 = Dead-zone clock equal to PWM base clock divide 2.
     * |        |          |10 = Dead-zone clock equal to PWM base clock divide 4.
     * |        |          |11 = Dead-zone clock equal to PWM base clock divide 8.
     * |[28]    |DTEN01    |Dead-Zone Enable Control For PWM Pair Of Channel 0 And Channel 1
     * |        |          |Dead-zone insertion is only active when this pair of complementary PWM is enabled.
     * |        |          |If Dead-zone insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-zone insertion Disabled.
     * |        |          |1 = Dead-zone insertion Enabled.
     * |[29]    |DTEN23    |Dead-Zone Enable Control For PWM Pair Of Channel 2 And Channel 3
     * |        |          |Dead-zone insertion is only active when this pair of complementary PWM is enabled.
     * |        |          |If Dead-zone insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-zone insertion Disabled.
     * |        |          |1 = Dead-zone insertion Enabled.
     * |[30]    |DTEN45    |Dead-Zone Enable Control For PWM Pair Of Channel 4 And Channel 5
     * |        |          |Dead-zone insertion is only active when this pair of complementary PWM is enabled.
     * |        |          |If Dead-zone insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-zone insertion Disabled.
     * |        |          |1 = Dead-zone insertion Enabled.
    */
    __IO uint32_t DTCTL;

    /**
     * TRGADCTL
     * ===================================================================================================
     * Offset: 0x64  PWM Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |PTRGEN    |PWM Period Point Trigger Enable Control
     * |        |          |0 = PWM period point trigger ADC function Disabled.
     * |        |          |1 = PWM period point trigger ADC function Enabled.
     * |        |          |PWM can trigger ADC to start conversion when PWM counter down count to zero if this bit is set to1.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[8:13]  |CTRGEN    |PWM Center Point Trigger Enable Control
     * |        |          |0 = PWM center point trigger ADC function Disabled.
     * |        |          |1 = PWM center point trigger ADC function Enabled.
     * |        |          |PWM can trigger ADC to start conversion when PWM counter up count to (PERIODn+1) if this bit is set to1.
     * |        |          |Note1: This bit should keep at 0 when PWM counter operating in Edge-aligned type.
     * |        |          |Note2: Each bit controls the corresponding PWM channel.
     * |[16:21] |FTRGEN    |PWM Falling Edge Point Trigger Enable Control
     * |        |          |0 = PWM falling edge point trigger ADC function Disabled.
     * |        |          |1 = PWM falling edge point trigger ADC function Enabled.
     * |        |          |PWM can trigger ADC to start conversion when PWM output pin falling edge is detected if this bit is set to1.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[24:29] |RTRGEN    |PWM Rising Edge Point Trigger Enable Control
     * |        |          |0 = PWM rising edge point trigger ADC function Disabled.
     * |        |          |1 = PWM rising edge point trigger ADC function Enabled.
     * |        |          |PWM can trigger ADC to start conversion when PWM output pin rising edge is detected if this bit is set to1.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t TRGADCTL;

    /**
     * TRGADCSTS
     * ===================================================================================================
     * Offset: 0x68  PWM Trigger ADC Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |PTRGF     |PWM Period Point Trigger Flag
     * |        |          |This bit is set to 1 by hardware when PWM counter down count to zero if corresponding PTRGEN bit is 1.
     * |        |          |After this bit is set to 1, ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Note1: Write 1 to clear this bit.
     * |        |          |Note2: Each bit controls the corresponding PWM channel.
     * |[8:13]  |CTRGF     |PWM Center Point Trigger Flag
     * |        |          |This bit is set to 1 by hardware when PWM counter up counts to (PERIODn+1) if the corresponding CTRGEN bit is 1.
     * |        |          |After this bit is set to 1, ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Note1: Write 1 to clear this bit.
     * |        |          |Note2: Each bit controls the corresponding PWM channel.
     * |[16:21] |FTRGF     |PWM Falling Edge Point Trigger Indicator
     * |        |          |This bit is set to 1 by hardware when PWM output pin falling edge is detected if corresponding FETRGEN bit is 1.
     * |        |          |After this bit is set to 1, ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Note1: Write 1 to clear this bit.
     * |        |          |Note2: Each bit controls the corresponding PWM channel.
     * |[24:29] |RTRGF     |PWM Rising Edge Point Trigger Indicator
     * |        |          |This bit is set to 1 by hardware when PWM output pin rising edge is detected if corresponding RETRGEN bit is 1.
     * |        |          |After this bit is set to 1, ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Note1: Write 1 to clear this bit.
     * |        |          |Note2: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t TRGADCSTS;

