RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
#define RTC_TAMP1PCTL_OUTLV_Pos          (0)                                               /*!< RTC_T::TAMP1PCTL: OUTLV Position          */
#define RTC_TAMP1PCTL_OUTLV_Msk          (0x1ul << RTC_TAMP1PCTL_OUTLV_Pos)                /*!< RTC_T::TAMP1PCTL: OUTLV Mask              */

#define RTC_TAMP1PCTL_OUTEN_Pos          (1)                                               /*!< RTC_T::TAMP1PCTL: OUTEN Position          */
#define RTC_TAMP1PCTL_OUTEN_Msk          (0x1ul << RTC_TAMP1PCTL_OUTEN_Pos)                /*!< RTC_T::TAMP1PCTL: OUTEN Mask              */

#define RTC_TAMP1PCTL_TRIEN_Pos          (2)                                               /*!< RTC_T::TAMP1PCTL: TRIEN Position          */
#define RTC_TAMP1PCTL_TRIEN_Msk          (0x1ul << RTC_TAMP1PCTL_TRIEN_Pos)                /*!< RTC_T::TAMP1PCTL: TRIEN Mask              */

#define RTC_TAMP1PCTL_TYPE_Pos           (3)                                               /*!< RTC_T::TAMP1PCTL: TYPE Position           */
#define RTC_TAMP1PCTL_TYPE_Msk           (0x1ul << RTC_TAMP1PCTL_TYPE_Pos)                 /*!< RTC_T::TAMP1PCTL: TYPE Mask               */

#define RTC_TAMP1PCTL_DINOFF_Pos         (4)                                               /*!< RTC_T::TAMP1PCTL: DINOFF Position         */
#define RTC_TAMP1PCTL_DINOFF_Msk         (0x1ul << RTC_TAMP1PCTL_DINOFF_Pos)               /*!< RTC_T::TAMP1PCTL: DINOFF Mask             */

#define RTC_LXTIPCTL_OUTLV_Pos           (0)                                               /*!< RTC_T::LXTIPCTL: OUTLV Position           */
#define RTC_LXTIPCTL_OUTLV_Msk           (0x1ul << RTC_LXTIPCTL_OUTLV_Pos)                 /*!< RTC_T::LXTIPCTL: OUTLV Mask               */

#define RTC_LXTIPCTL_OUTEN_Pos           (1)                                               /*!< RTC_T::LXTIPCTL: OUTEN Position           */
#define RTC_LXTIPCTL_OUTEN_Msk           (0x1ul << RTC_LXTIPCTL_OUTEN_Pos)                 /*!< RTC_T::LXTIPCTL: OUTEN Mask               */

#define RTC_LXTIPCTL_TRIEN_Pos           (2)                                               /*!< RTC_T::LXTIPCTL: TRIEN Position           */
#define RTC_LXTIPCTL_TRIEN_Msk           (0x1ul << RTC_LXTIPCTL_TRIEN_Pos)                 /*!< RTC_T::LXTIPCTL: TRIEN Mask               */

#define RTC_LXTIPCTL_TYPE_Pos            (3)                                               /*!< RTC_T::LXTIPCTL: TYPE Position            */
#define RTC_LXTIPCTL_TYPE_Msk            (0x1ul << RTC_LXTIPCTL_TYPE_Pos)                  /*!< RTC_T::LXTIPCTL: TYPE Mask                */

#define RTC_LXTIPCTL_DINOFF_Pos          (4)                                               /*!< RTC_T::LXTIPCTL: DINOFF Position          */
#define RTC_LXTIPCTL_DINOFF_Msk          (0x1ul << RTC_LXTIPCTL_DINOFF_Pos)                /*!< RTC_T::LXTIPCTL: DINOFF Mask              */

#define RTC_LXTOPCTL_OUTLV_Pos           (0)                                               /*!< RTC_T::LXTOPCTL: OUTLV Position           */
#define RTC_LXTOPCTL_OUTLV_Msk           (0x1ul << RTC_LXTOPCTL_OUTLV_Pos)                 /*!< RTC_T::LXTOPCTL: OUTLV Mask               */

#define RTC_LXTOPCTL_OUTEN_Pos           (1)                                               /*!< RTC_T::LXTOPCTL: OUTEN Position           */
#define RTC_LXTOPCTL_OUTEN_Msk           (0x1ul << RTC_LXTOPCTL_OUTEN_Pos)                 /*!< RTC_T::LXTOPCTL: OUTEN Mask               */

#define RTC_LXTOPCTL_TRIEN_Pos           (2)                                               /*!< RTC_T::LXTOPCTL: TRIEN Position           */
#define RTC_LXTOPCTL_TRIEN_Msk           (0x1ul << RTC_LXTOPCTL_TRIEN_Pos)                 /*!< RTC_T::LXTOPCTL: TRIEN Mask               */

#define RTC_LXTOPCTL_TYPE_Pos            (3)                                               /*!< RTC_T::LXTOPCTL: TYPE Position            */
#define RTC_LXTOPCTL_TYPE_Msk            (0x1ul << RTC_LXTOPCTL_TYPE_Pos)                  /*!< RTC_T::LXTOPCTL: TYPE Mask                */

#define RTC_LXTOPCTL_DINOFF_Pos          (4)                                               /*!< RTC_T::LXTOPCTL: DINOFF Position          */
#define RTC_LXTOPCTL_DINOFF_Msk          (0x1ul << RTC_LXTOPCTL_DINOFF_Pos)                /*!< RTC_T::LXTOPCTL: DINOFF Mask              */

#define RTC_TAMSK_MSEC_Pos               (0)                                               /*!< RTC_T::TAMSK: MSEC Position            */
#define RTC_TAMSK_MSEC_Msk               (0x1ul << RTC_TAMSK_MSEC_Pos)                     /*!< RTC_T::TAMSK: MSEC Mask                */

#define RTC_TAMSK_MTENSEC_Pos            (1)                                               /*!< RTC_T::TAMSK: MTENSEC Position           */
#define RTC_TAMSK_MTENSEC_Msk            (0x1ul << RTC_TAMSK_MTENSEC_Pos)                  /*!< RTC_T::TAMSK: MTENSEC Mask               */

#define RTC_TAMSK_MMIN_Pos               (2)                                               /*!< RTC_T::TAMSK: MMIN Position            */
#define RTC_TAMSK_MMIN_Msk               (0x1ul << RTC_TAMSK_MMIN_Pos)                     /*!< RTC_T::TAMSK: MMIN Mask                */

#define RTC_TAMSK_MTENMIN_Pos            (3)                                               /*!< RTC_T::TAMSK: MTENMIN Position           */
#define RTC_TAMSK_MTENMIN_Msk            (0x1ul << RTC_TAMSK_MTENMIN_Pos)                  /*!< RTC_T::TAMSK: MTENMIN Mask               */

#define RTC_TAMSK_MHR_Pos                (4)                                               /*!< RTC_T::TAMSK: MHR Position             */
#define RTC_TAMSK_MHR_Msk                (0x1ul << RTC_TAMSK_MHR_Pos)                      /*!< RTC_T::TAMSK: MHR Mask                 */

#define RTC_TAMSK_MTENHR_Pos             (5)                                               /*!< RTC_T::TAMSK: MTENHR Position            */
#define RTC_TAMSK_MTENHR_Msk             (0x1ul << RTC_TAMSK_MTENHR_Pos)                   /*!< RTC_T::TAMSK: MTENHR Mask                */

#define RTC_CAMSK_MDAY_Pos               (0)                                               /*!< RTC_T::CAMSK: MDAY Position            */
#define RTC_CAMSK_MDAY_Msk               (0x1ul << RTC_CAMSK_MDAY_Pos)                     /*!< RTC_T::CAMSK: MDAY Mask                */

#define RTC_CAMSK_MTENDAY_Pos            (1)                                               /*!< RTC_T::CAMSK: MTENDAY Position           */
#define RTC_CAMSK_MTENDAY_Msk            (0x1ul << RTC_CAMSK_MTENDAY_Pos)                  /*!< RTC_T::CAMSK: MTENDAY Mask               */

#define RTC_CAMSK_MMON_Pos               (2)                                               /*!< RTC_T::CAMSK: MMON Position            */
#define RTC_CAMSK_MMON_Msk               (0x1ul << RTC_CAMSK_MMON_Pos)                     /*!< RTC_T::CAMSK: MMON Mask                */

#define RTC_CAMSK_MTENMON_Pos            (3)                                               /*!< RTC_T::CAMSK: MTENMON Position           */
#define RTC_CAMSK_MTENMON_Msk            (0x1ul << RTC_CAMSK_MTENMON_Pos)                  /*!< RTC_T::CAMSK: MTENMON Mask               */

#define RTC_CAMSK_MYEAR_Pos              (4)                                               /*!< RTC_T::CAMSK: MYEAR Position           */
#define RTC_CAMSK_MYEAR_Msk              (0x1ul << RTC_CAMSK_MYEAR_Pos)                    /*!< RTC_T::CAMSK: MYEAR Mask               */

#define RTC_CAMSK_MTENYEAR_Pos           (5)                                               /*!< RTC_T::CAMSK: MTENYEAR Position          */
#define RTC_CAMSK_MTENYEAR_Msk           (0x1ul << RTC_CAMSK_MTENYEAR_Pos)                 /*!< RTC_T::CAMSK: MTENYEAR Mask              */

/**@}*/ /* RTC_CONST */
/**@}*/ /* end of RTC register group */


/*---------------------- Smart Card Host Interface Controller -------------------------*/
/**
    @addtogroup SC Smart Card Host Interface Controller(SC)
    Memory Mapped Structure for SC Controller
@{ */

