RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/Device/Nuvoton/NUC472_442/Include/NUC472_442.h
typedef struct {
    /**
     * HcRevision
     * ===================================================================================================
     * Offset: 0x00  Host Controller Revision Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |REV       |Revision
     * |        |          |Indicates the Open HCI Specification revision number implemented by the Hardware.
     * |        |          |Host Controller supports 1.1 specification.
     * |        |          |(X.Y = XYh).
    */
    __I  uint32_t HcRevision;

    /**
     * HcControl
     * ===================================================================================================
     * Offset: 0x04  Host Controller Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |CBSR      |Control Bulk Service Ratio
     * |        |          |Specifies the number of Control Endpoints serviced for every Bulk Endpoint.
     * |        |          |Encoding is N-1 where N is the number of Control Endpoints (i.e.
     * |        |          |'00' = 1 Control Endpoint; '11' = 3 Control Endpoints).
     * |[2]     |PLE       |Periodic List Enable Control
     * |        |          |When set, this bit enables processing of the Periodic (interrupt and isochronous) list.
     * |        |          |The Host Controller checks this bit prior to attempting any periodic transfers in a frame.
     * |[3]     |IE        |Isochronous List Enable Control
     * |        |          |When cleared, this bit disables the Isochronous List when the Periodic List is enabled (so Interrupt EDs may be serviced).
     * |        |          |While processing the Periodic List, the Host Controller will check this bit when it finds an isochronous ED.
     * |[4]     |CLE       |Control List Enable Control
     * |        |          |When set, this bit enables processing of the Control list.
     * |[5]     |BLE       |Bulk List Enable Control
     * |        |          |When set, this bit enables processing of the Bulk list.
     * |[6:7]   |HCFS      |Host Controller Functional State
     * |        |          |This field sets the Host Controller state.
     * |        |          |The Controller may force a state change from USBSUSPEND to USBRESUME after detecting resume signaling from a downstream port.
     * |        |          |States are:.
     * |        |          |00 = USBSUSPEND.
     * |        |          |01 = USBRESUME.
     * |        |          |10 = USBOPERATIONAL.
     * |        |          |11 = USBRESET.
     * |[9]     |RWC       |Remote Wake-Up Connected
     * |        |          |This bit indicated whether the HC supports a remote wake-up signal.
     * |        |          |This implementation does not support any such signal.
     * |        |          |The bit is hard-coded to '0.'.
     * |[10]    |RWE       |Remote Wake-Up Connected Enable Control
     * |        |          |If a remote wake-up signal is supported, this bit enables that operation.
     * |        |          |Since there is no remote wake-up signal supported, this bit is ignored.
    */
    __IO uint32_t HcControl;

    /**
     * HcCommandStatus
     * ===================================================================================================
     * Offset: 0x08  Host Controller Command Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HCR       |Host Controller Reset
     * |        |          |This bit is set to initiate the software reset.
     * |        |          |This bit is cleared by the Host Controller, upon completed of the reset operation.
     * |[1]     |CLF       |Control List Filled
     * |        |          |Set to indicate there is an active ED on the Control List.
     * |        |          |It may be set by either software or the Host Controller and cleared by the Host Controller each time it begins processing the head of the Control List.
     * |[2]     |BLF       |Bulk List Filled
     * |        |          |Set to indicate there is an active ED on the Bulk List.
     * |        |          |The bit may be set by either software or the Host Controller and cleared by the Host Controller each time it begins processing the head of the Bulk List.
     * |[16:17] |SOC       |Schedule Overrun Count
     * |        |          |This field is incremented every time the SchedulingOverrun bit in HcInterruptStatus is set.
     * |        |          |The count wraps from '11' to '00'.
    */
    __IO uint32_t HcCommandStatus;

    /**
     * HcInterruptStatus
     * ===================================================================================================
     * Offset: 0x0C  Host Controller Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SO        |Scheduling Overrun
     * |        |          |Set when the List Processor determines a Schedule Overrun has occurred.
     * |[1]     |WDH       |Write Back Done Head
     * |        |          |Set after the Host Controller has written HcDoneHead to HccaDoneHead.
     * |[2]     |SF        |Start Of Frame
     * |        |          |Set when the Frame Management block signals a 'Start of Frame' event.
     * |[3]     |RD        |Resume Detected
     * |        |          |Set when Host Controller detects resume signaling on a downstream port.
     * |[4]     |UE        |Unrecoverable Error
     * |        |          |This event is not implemented and is hard-coded to '0.' Writes are ignored.
     * |[5]     |FNOF      |Frame Number Overflow
     * |        |          |Set when bit 15 of Frame Number changes value.
     * |[6]     |RHSC      |Root Hub Status Change
     * |        |          |This bit is set when the content of HcRhStatus or the content of any HcRhPortStatus register has changed.
    */
    __IO uint32_t HcInterruptStatus;

    /**
     * HcInterruptEnable
     * ===================================================================================================
     * Offset: 0x10  Host Controller Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SO        |Scheduling Overrun Enable Control
     * |        |          |0 = The interrupt function Disabled.
     * |        |          |1 = Interrupt generation Enabled due to Scheduling Overrun.
     * |[1]     |WDH       |Write Back Done Head Enable Control
     * |        |          |0 = The interrupt function Disabled.
     * |        |          |1 = Interrupt generation Enabled due to Write-back Done Head.
     * |[2]     |SF        |Start Of Frame Enable Control
     * |        |          |0 = The interrupt function Disabled.
     * |        |          |1 = interrupt generation Enabled due to Start of Frame.
     * |[3]     |RD        |Resume Detected Enable Control
     * |        |          |0 = The interrupt function Disabled.
     * |        |          |1 = interrupt generation Enabled due to Resume Detected.
     * |[4]     |UE        |Unrecoverable Error Enable Control
     * |        |          |This event is not implemented. All writes to this bit are ignored.
     * |[5]     |FNO       |Frame Number Overflow Enable Control
     * |        |          |0 = The interrupt function Disabled.
     * |        |          |1 = Interrupt generation Enabled due to Frame Number Overflow.
     * |[6]     |RHSC      |Root Hub Status Change Enable Control
     * |        |          |0 = The interrupt function Disabled.
     * |        |          |1 = interrupt generation Enabled due to Root Hub Status Change.
     * |[31]    |MIE       |Master Interrupt Enable Control
     * |        |          |This bit is a global interrupt enable.
     * |        |          |A write of '1' allows interrupts to be enabled via the specific enable bits listed above.
    */
    __IO uint32_t HcInterruptEnable;

    /**
     * HcInterruptDisable
     * ===================================================================================================
     * Offset: 0x14  Host Controller Interrupt Disable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SO        |Scheduling Overrun Disable Control
     * |        |          |0 = No effect.
     * |        |          |1 = Interrupt generation Disabled due to Scheduling Overrun.
     * |[1]     |WDH       |Write Back Done Head Disable Control
     * |        |          |0 = No effect.
     * |        |          |1 = Interrupt generation Disabled due to Write-back Done Head.
     * |[2]     |SF        |Start Of Frame Disable Control
     * |        |          |0 = No effect.
     * |        |          |1 = Interrupt generation Disabled due to Start of Frame.
     * |[3]     |RD        |Resume Detected Disable Control
     * |        |          |0 = No effect.
     * |        |          |1 = Interrupt generation Disabled due to Resume Detected.
     * |[4]     |UE        |Unrecoverable Error Disable Control
     * |        |          |This event is not implemented. All writes to this bit are ignored.
     * |[5]     |FNO       |Frame Number Overflow Disable Control
     * |        |          |0 = No effect.
     * |        |          |1 = Interrupt generation Disabled due to Frame Number Overflow.
     * |[6]     |RHSC      |Root Hub Status Change Disable Control
     * |        |          |0 = No effect.
     * |        |          |1 = Interrupt generation Disabled due to Root Hub Status Change.
     * |[31]    |MIE       |Master Interrupt Disable Control
     * |        |          |Global interrupt disable. Writing '1' to disable all interrupts.
    */
    __IO uint32_t HcInterruptDisable;

    /**
     * HcHCCA
     * ===================================================================================================
     * Offset: 0x18  Host Controller Communication Area Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:31]  |HCCA      |Host Controller Communication Area
     * |        |          |Pointer to HCCA base address.
    */
    __IO uint32_t HcHCCA;

    /**
     * HcPeriodCurrentED
     * ===================================================================================================
     * Offset: 0x1C  Host Controller Period Current ED Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:31]  |PCED      |Periodic Current ED
     * |        |          |Pointer to the current Periodic List ED.
    */
    __IO uint32_t HcPeriodCurrentED;

    /**
     * HcControlHeadED
     * ===================================================================================================
     * Offset: 0x20  Host Controller Control Head ED Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:31]  |CHED      |Control Head ED
     * |        |          |Pointer to the Control List Head ED.
    */
    __IO uint32_t HcControlHeadED;

    /**
     * HcControlCurrentED
     * ===================================================================================================
     * Offset: 0x24  Host Controller Control Current ED Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:31]  |CCED      |Control Current Head ED
     * |        |          |Pointer to the current Control List Head ED.
    */
    __IO uint32_t HcControlCurrentED;

    /**
     * HcBulkHeadED
     * ===================================================================================================
     * Offset: 0x28  Host Controller Bulk Head ED Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:31]  |BHED      |Bulk Head ED
     * |        |          |Pointer to the Bulk List Head ED.
    */
    __IO uint32_t HcBulkHeadED;

    /**
     * HcBulkCurrentED
     * ===================================================================================================
     * Offset: 0x2C  Host Controller Bulk Current ED Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:31]  |BCED      |Bulk Current Head ED
     * |        |          |Pointer to the current Bulk List Head ED.
    */
    __IO uint32_t HcBulkCurrentED;

    /**
     * HcDoneHead
     * ===================================================================================================
     * Offset: 0x30  Host Controller Done Head Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:31]  |DH        |Done Head
     * |        |          |Pointer to the current Done List Head ED.
    */
    __IO uint32_t HcDoneHead;

    /**
     * HcFmInterval
     * ===================================================================================================
     * Offset: 0x34  Host Controller Frame Interval Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:13]  |FI        |Frame Interval
     * |        |          |This field specifies the length of a frame as (bit times - 1).
     * |        |          |For 12,000 bit times in a frame, a value of 11,999 is stored here.
     * |[16:30] |FSMPS     |FS Largest Data Packet
     * |        |          |This field specifies a value that is loaded into the Largest Data Packet Counter at the beginning of each frame.
     * |[31]    |FIT       |Frame Interval Toggle
     * |        |          |This bit is toggled by HCD when it loads a new value into Frame Interval.
    */
    __IO uint32_t HcFmInterval;

    /**
     * HcFmRemaining
     * ===================================================================================================
     * Offset: 0x38  Host Controller Frame Remaining Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:13]  |FR        |Frame Remaining
     * |        |          |When the Host Controller is in the USBOPERATIONAL state, this 14-bit field decrements each 12 MHz clock period.
     * |        |          |When the count reaches 0, (end of frame) the counter reloads with Frame Interval.
     * |        |          |In addition, the counter loads when the Host Controller transitions into USBOPERATIONAL.
     * |[31]    |FRT       |Frame Remaining Toggle
     * |        |          |Loaded with Frame Interval Toggle when FrameRemaining is loaded.
    */
    __I  uint32_t HcFmRemaining;

    /**
     * HcFmNumber
     * ===================================================================================================
     * Offset: 0x3C  Host Controller Frame Number Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FN        |Frame Number
     * |        |          |This 16-bit incrementing counter field is incremented coincident with the loading of FrameRemaining.
     * |        |          |The count rolls over from 'FFFFh' to '0h.'.
    */
    __I  uint32_t HcFmNumber;

    /**
     * HcPeriodicStart
     * ===================================================================================================
     * Offset: 0x40  Host Controller Periodic Start Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:13]  |PS        |Periodic Start
     * |        |          |This field contains a value used by the List Processor to determine where in a frame the Periodic List processing must begin.
    */
    __IO uint32_t HcPeriodicStart;

    /**
     * HcLSThreshold
     * ===================================================================================================
     * Offset: 0x44  Host Controller Low-speed Threshold Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |LST       |Low-Speed Threshold
     * |        |          |This field contains a value which is compared to the FrameRemaining field prior to initiating a Low-speed transaction.
     * |        |          |The transaction is started only if FrameRemaining >= this field.
     * |        |          |The value is calculated by HCD with the consideration of transmission and setup overhead.
    */
    __IO uint32_t HcLSThreshold;

    /**
     * HcRhDescriptorA
     * ===================================================================================================
     * Offset: 0x48  Host Controller Root Hub Descriptor A Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |NDP       |Number Downstream Ports
     * |        |          |Root Hub supports two downstream ports. It's 2 in this Root Hub.
     * |[8]     |PSM       |Power Switching Mode
     * |        |          |Global power switching mode implemented in Root Hub.
     * |        |          |This bit is only valid when NPS bit is cleared.
     * |        |          |This bit should be written '0'.
     * |        |          |0 = Global Switching.
     * |        |          |1 = Individual Switching.
     * |[9]     |NPS       |No Power Switching
     * |        |          |Global power switching implemented in Root Hub.
     * |        |          |This bit should be written to support the external system port power switching implementation.
     * |        |          |0 = Ports are power switched.
     * |        |          |1 = Ports are always powered on.
     * |[10]    |DT        |Device Type
     * |        |          |The OHCI Root Hub is not a compound device.
     * |[11]    |OCPM      |Overcurrent Protection Mode
     * |        |          |Global overcurrent reporting implemented in Root Hub.
     * |        |          |This bit should be written 0 and is only valid when NOCP bit is cleared.
     * |        |          |0 = Global Overcurrent.
     * |        |          |1 = Individual Overcurrent.
     * |[12]    |NOCP      |No Overcurrent Protection
     * |        |          |Global overcurrent reporting implemented in Root Hub.
     * |        |          |This bit should be written to support the external system port overcurrent implementation.
     * |        |          |0 = Overcurrent status is reported.
     * |        |          |1 = Overcurrent status is not reported.
     * |[24:31] |POTGT     |Power On To Power Good Time
     * |        |          |This field value is represented as the number of 2 ms intervals, which ensuring that the power switching is effective within 2 ms.
     * |        |          |Only bits [25:24] are implemented as R/W.
     * |        |          |The remaining bits are read only as '0'.
     * |        |          |It is not expected that these bits be written to anything other than 1h, but limited adjustment is provided.
     * |        |          |This field should be written to support system implementation.
     * |        |          |This field should always be written to a non-zero value.
    */
    __IO uint32_t HcRhDescriptorA;

    /**
     * HcRhDescriptorB
     * ===================================================================================================
     * Offset: 0x4C  Host Controller Root Hub Descriptor B Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:2]   |DR        |Device Removable
     * |        |          |Root Hub ports default to removable devices.
     * |        |          |0 = Device not removable.
     * |        |          |1 = Device removable.
     * |        |          |Port Bit relationship:
     * |        |          |DevRemove[0] = Reserved.
     * |        |          |DevRemove[1] = Port 1.
     * |        |          |DevRemove[2] = Port 2.
    */
    __IO uint32_t HcRhDescriptorB;

